documentation/cxsetup/cxsetup_2.0.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-04-18 sex 20:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CX Setup Official Documentation (v2.0.N)</title>
<meta name="author" content="Matthew (MF366)" />
<meta name="description" content="The official documentation for the CX Setup language." />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">CX Setup Official Documentation (v2.0.N)</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org12a1424">1. About the Documentation</a>
<ul>
<li><a href="#orga7860a5">1.1. Licensing (Docs)</a></li>
<li><a href="#orgc5f43e0">1.2. Contributing</a></li>
</ul>
</li>
<li><a href="#org7f5ab6a">2. Comments</a></li>
<li><a href="#org939bfe8">3. Data Types</a></li>
<li><a href="#org95fd2c0">4. String Escape Characters (v2.0.0+)</a></li>
<li><a href="#org9b3b251">5. Keywords</a>
<ul>
<li><a href="#orgf2272af">5.1. <code>COUT</code></a></li>
<li><a href="#orgf88dd12">5.2. <code>ENDL</code> and <code>ENDL2</code></a></li>
<li><a href="#org7fa5351">5.3. <code>STYLE</code>, <code>FORE</code> and <code>BACK</code></a></li>
<li><a href="#org58ce561">5.4. <code>TERMINATE</code> (0/1 argument overload)</a></li>
<li><a href="#orgb650a97">5.5. <code>TERMINATE</code> (2 arguments overload - v2.0.0+)</a></li>
<li><a href="#org2404d3f">5.6. <code>CIN</code> (0 arguments overload)</a></li>
<li><a href="#orgf9f6ccb">5.7. <code>CIN</code> (1 argument overload)</a></li>
<li><a href="#orgf6cb061">5.8. <code>RUN</code></a>
<ul>
<li><a href="#org3550942">5.8.1. The Number 1 cause of error when using <code>RUN</code></a></li>
</ul>
</li>
<li><a href="#orge130f5f">5.9. <code>CIN</code> (2 arguments overload)</a></li>
<li><a href="#org0659034">5.10. <code>GETPASS</code></a></li>
<li><a href="#orga9025d4">5.11. <code>SAFECIN</code> (1 argument overload)</a></li>
<li><a href="#org2bf3de1">5.12. <code>SAFECIN</code> (2 arguments overload)</a></li>
<li><a href="#orga9ee762">5.13. <code>ECHO</code></a></li>
<li><a href="#org18db1ec">5.14. <code>ECHORDIE</code></a></li>
<li><a href="#org90caf46">5.15. <code>PIPRUN</code>, <code>PKGRUN</code>, <code>NPMRUN</code></a></li>
<li><a href="#org2cea8c0">5.16. <code>REQUIRES</code></a></li>
<li><a href="#orgcc9485b">5.17. <code>REQINSTALL</code></a></li>
</ul>
</li>
<li><a href="#org800da90">6. Cache</a>
<ul>
<li><a href="#orgf762dec">6.1. Reading</a></li>
<li><a href="#org11100cb">6.2. Writing</a>
<ul>
<li><a href="#org10b0fc3">6.2.1. Keywords that Write to the Cache Directly</a></li>
<li><a href="#org5e607ee">6.2.2. List of Keywords that Write to the Cache Indirectly</a></li>
</ul>
</li>
<li><a href="#org26b895e">6.3. Benefits of caching</a></li>
</ul>
</li>
<li><a href="#org5ebd060">7. Environment Variables</a></li>
<li><a href="#org9203040">8. CX Vars (v2.0.0+)</a></li>
<li><a href="#org2134bd2">9. Polarity</a>
<ul>
<li><a href="#org2e99972">9.1. Defining code paths</a></li>
<li><a href="#org7a96580">9.2. <code>RESET</code></a></li>
<li><a href="#orga32937e">9.3. <code>INVERT</code></a></li>
<li><a href="#org8d8b53d">9.4. <code>YAYORNAY</code></a></li>
<li><a href="#orgdff97b5">9.5. Other polarity-related keywords</a></li>
</ul>
</li>
<li><a href="#org7a32fd1">10. Mathematical Operations (v2.0.0+)</a></li>
<li><a href="#orga353f59">11. File Operations (v2.0.0+)</a></li>
<li><a href="#org17ec4fa">12. Cache Size Declaration</a></li>
<li><a href="#org40bcf0a">13. Examples</a>
<ul>
<li><a href="#orge8976cc">13.1. Writing Hello, World! to a file called cxsetup-playground</a></li>
<li><a href="#orga022007">13.2. Global Cheat Sheet (for v1.0.0)</a></li>
</ul>
</li>
<li><a href="#org5129cef">14. Other tools</a></li>
</ul>
</div>
</div>
<div id="outline-container-org12a1424" class="outline-2">
<h2 id="org12a1424"><span class="section-number-2">1.</span> About the Documentation</h2>
<div class="outline-text-2" id="text-1">
<p>
The page/document you are currently looking at is the <b>Official Documentation for the CX Setup scripting language</b>. It was made primarily by Matthew (<a href="https://mf366-coding.github.io">MF366</a>) using <code>Org Mode</code> on <code>Emacs</code>, later exported to <code>HTML</code>.
</p>
</div>
<div id="outline-container-orga7860a5" class="outline-3">
<h3 id="orga7860a5"><span class="section-number-3">1.1.</span> Licensing (Docs)</h3>
<div class="outline-text-3" id="text-1-1">
<p>
This documentation is licensed under the <a href="https://www.gnu.org/licenses/fdl-1.3.txt"><b>GNU Free Documentation License (GFDL)</b></a>. Therefore, all edits, reuses and whatnot of this documentation (valid for both <code>Org</code> and <code>HTML</code> versions of the docs) must comply with GFDL&rsquo;s terms and conditions.
</p>
</div>
</div>
<div id="outline-container-orgc5f43e0" class="outline-3">
<h3 id="orgc5f43e0"><span class="section-number-3">1.2.</span> Contributing</h3>
<div class="outline-text-3" id="text-1-2">
<p>
If you wish to contribute to the documentation, I&rsquo;d really appreciate it. However, there are some rules and guidelines you must follow:
</p>
<ul class="org-ul">
<li><b>KISS: Keep It Simple, Stupid.</b> Make sure your changes do not affect the simplicity and readability of the documentation in a negative way.</li>
<li><b>If it ain’t broken, don’t redesign it.</b> Do not propose changes to how the UI should look, as the current combination of HTML and CSS aims for simplicity, due to the fact it&rsquo;s very objective.</li>
<li><b>Editing the HTML export is like painting a screenshot — impressive, but pointless.</b> Make <i>Pull Requests</i> for the <code>Org</code> files, not the <code>HTML</code> ones.</li>
<li><b>Fixing typos is noble; flooding PRs with them is chaos.</b> Typo squatting is perfectly fine and helpful, but don&rsquo;t make too many <i>Pull Requests</i> to fix typos in a row, as it causes unnecessary spam. The best alternative is to &ldquo;bundle&rdquo; several typo fixes in one PR.</li>
<li><b>There are no stupid questions — only unanswered ones (and I try to avoid those).</b> If you have any questions, don&rsquo;t hesitate to ask, as I try to reply to all. You can use the following e-mail: <a href="mailto:real_mf366@yahoo.com"><code>real_mf366@yahoo.com</code></a>.</li>
</ul>

<p>
If those rules did not scare you away, the GitHub repository is <a href="https://github.com/MF366-Coding/mf366-coding.github.io">right here</a>. Thanks ahead for your contributions.
</p>
</div>
</div>
</div>
<div id="outline-container-org7f5ab6a" class="outline-2">
<h2 id="org7f5ab6a"><span class="section-number-2">2.</span> Comments</h2>
<div class="outline-text-2" id="text-2">
<p>
Just like in any other scripting language, CXSetup allows comments, albeit only single-line ones.
</p>

<div class="org-src-container">
<pre class="src src-nil">// This is a comment
// This is another comment
# This is a syntax error
&lt;!-- So is this --&gt;
// Comments must start with //
// They also last until the end of the line, semicolon or not
</pre>
</div>
</div>
</div>
<div id="outline-container-org939bfe8" class="outline-2">
<h2 id="org939bfe8"><span class="section-number-2">3.</span> Data Types</h2>
<div class="outline-text-2" id="text-3">
<p>
Keywords will be a matter of discussion later on, but they require arguments, which must be passed programatically. Each keyword argument must conform to a supported data type.
</p>

<p>
The available data types are:
</p>
<ul class="org-ul">
<li><b>Bytes</b> (rarely used - cannot be represented without a cache grab)</li>
<li><b>String</b> (text data - <code>"Hello, World"</code>)</li>
<li><b>Character</b> (single character - <code>"a"</code>)</li>
<li><b>Integer</b> (whole number, can be positive or negative - <code>5</code>)</li>
<li><b>Float</b> (decimal number - <code>3.14</code>)</li>
</ul>
</div>
</div>
<div id="outline-container-org95fd2c0" class="outline-2">
<h2 id="org95fd2c0"><span class="section-number-2">4.</span> String Escape Characters (v2.0.0+)</h2>
<div class="outline-text-2" id="text-4">
<p>
This new feature available in version 2.0.0 and above is extremely useful when you need to create strings with characters <b>CX Setup</b> would otherwise consider to be special.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Escape Character</th>
<th scope="col" class="org-left">Conversion</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>\S</code></td>
<td class="org-left"><b>Semicolon</b> (<code>;</code>)</td>
</tr>

<tr>
<td class="org-left"><code>\?</code></td>
<td class="org-left"><b>Question Mark</b> (<code>?</code>)</td>
</tr>

<tr>
<td class="org-left"><code>\2</code></td>
<td class="org-left"><b>Double Quotes</b> (<code>"</code>)</td>
</tr>

<tr>
<td class="org-left"><code>\\</code></td>
<td class="org-left"><b>Backslash</b> (<code>\</code>)</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org9b3b251" class="outline-2">
<h2 id="org9b3b251"><span class="section-number-2">5.</span> Keywords</h2>
<div class="outline-text-2" id="text-5">
<p>
In CXSetup, there are no functions, classes, or even variables. Scripts are built entirely from keywords — each acting like a mini-command that does one specific job.
</p>

<p>
Here is an example of keywords in use:
</p>
<div class="org-src-container">
<pre class="src src-nil">// COUT outputs something to the screen with no newline
COUT ?? "Hello, World!";

// Let's try doing a neofetch
RUN ?? "neofetch";
</pre>
</div>

<p>
Below are the available keywords in CXSetup.
</p>

<hr />
</div>
<div id="outline-container-orgf2272af" class="outline-3">
<h3 id="orgf2272af"><span class="section-number-3">5.1.</span> <code>COUT</code></h3>
<div class="outline-text-3" id="text-5-1">
<p>
Quite possibly, one of the simplest keywords. Outputs something to the screen without a newline.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Outputs text to <code>stdout</code>.</td>
<td class="org-left">Accepts any amount of string arguments as the text to output.</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
<td class="org-left"><code>COUT ?? "Hello, World!";</code></td>
</tr>
</tbody>
</table>
</div>
</div>
