documentation/cxsetup/cxsetup_2.0.org
** =ENDL= and =ENDL2=
These ones are also extremely simple: all they do is output new lines to the screen. =ENDL= outputs 1 newline, while =ENDL2= outputs 2.

| Summary                                             | Arguments                              | Returns | Exceptions | Example      |
|-----------------------------------------------------+----------------------------------------+---------+------------+--------------|
| Outputs newlines to ~stdout~ (1 if =ENDL=, 2 if =ENDL2=). | Does not accept or need any arguments. | None    | None       | =ENDL; ENDL2;= |

** =STYLE=, =FORE= and =BACK=
These 3 keywords all serve the same general purpose: styling text. To better understand them, they've been split into 3 tables, one for each.

| =STYLE=                                                          | Arguments                                                                                                                                            | Returns | Exceptions                          | Example            |
|----------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------+---------+-------------------------------------+--------------------|
| Applies a style to ~stdout~ (lasts until =STYLE ?? "RESET_ALL";=). | Accepts one string argument representing the style to apply (must be one of: ~DIM~, ~RESET~, ~RESET_ALL~, ~BRIGHT~, ~NORMAL~). ~RESET~ is the same as ~RESET_ALL~. | None    | ~ValueError~ - invalid style argument | =STYLE ?? "BRIGHT";= |

| =FORE=                                                                                          | Arguments                                                                                                                                                                                                                                                          | Returns | Exceptions                                     | Example           |
|-----------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------+------------------------------------------------+-------------------|
| Applies a foreground color to ~stdout~ (lasts until =STYLE ?? "RESET_ALL";= or =FORE ?? "RESET";=). | Accepts one string argument representing the color to apply (must be one of: ~RESET~, ~BLACK~, ~BLUE~, ~GREEN~, ~YELLOW~, ~MAGENTA~, ~RED~, ~CYAN~, ~WHITE~, ~LIGHTBLACK_EX~, ~LIGHTBLUE_EX~, ~LIGHTGREEN_EX~, ~LIGHTYELLOW_EX~, ~LIGHTMAGENTA_EX~, ~LIGHTRED_EX~, ~LIGHTCYAN_EX~, ~LIGHTWHITE_EX~). | None    | ~ValueError~ - invalid foreground color argument | =FORE ?? "YELLOW";= |

| =BACK=                                                                                          | Arguments                                                                                                                                                                                                                                                          | Returns | Exceptions                                     | Example                 |
|-----------------------------------------------------------------------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------+------------------------------------------------+-------------------------|
| Applies a background color to ~stdout~ (lasts until =STYLE ?? "RESET_ALL";= or =BACK ?? "RESET";=). | Accepts one string argument representing the color to apply (must be one of: ~RESET~, ~BLACK~, ~BLUE~, ~GREEN~, ~YELLOW~, ~MAGENTA~, ~RED~, ~CYAN~, ~WHITE~, ~LIGHTBLACK_EX~, ~LIGHTBLUE_EX~, ~LIGHTGREEN_EX~, ~LIGHTYELLOW_EX~, ~LIGHTMAGENTA_EX~, ~LIGHTRED_EX~, ~LIGHTCYAN_EX~, ~LIGHTWHITE_EX~). | None    | ~ValueError~ - invalid background color argument | =BACK ?? "LIGHTBLUE_EX";= |

** =TERMINATE= (0/1 argument overload)
This is the keyword responsible for terminating the script safely instead of waiting for the end of the file.

| Summary                                                  | Arguments                                  | Returns | Exceptions                             | Example                         |
|----------------------------------------------------------+--------------------------------------------+---------+----------------------------------------+---------------------------------|
| Terminates the execution of the current CX Setup script. | ~ExitCode~ - optional integer, defaults to 0 | None    | ~TypeError~ - ~ExitCode~ is not an integer | =TERMINATE ?? 4; // error code 4= |

** =TERMINATE= (2 arguments overload - v2.0.0+)
New in v2.0.0, this overload of =TERMINATE= allows for more verbosity.

It can be given a custom exit message that will be shown if the ~ExitCode~ is *not* 0.

| Summary                                                  | Arguments                                   | Returns | Exceptions                                                                  | Example                                                             |
|----------------------------------------------------------+---------------------------------------------+---------+-----------------------------------------------------------------------------+---------------------------------------------------------------------|
| Terminates the execution of the current CX Setup script. | ~ExitCode~ - integer; ~CustomMessage~ - string; | None    | ~TypeError~ - ~ExitCode~ is not an integer / ~CustomMessage~ is not a string/char | =TERMINATE ?? 4 ?? "Something unexpected happened!"; // error code 4= |

