documentation/cxsetup/cxsetup_2.0.html
<div id="outline-container-orgf88dd12" class="outline-3">
<h3 id="orgf88dd12"><span class="section-number-3">5.2.</span> <code>ENDL</code> and <code>ENDL2</code></h3>
<div class="outline-text-3" id="text-5-2">
<p>
These ones are also extremely simple: all they do is output new lines to the screen. <code>ENDL</code> outputs 1 newline, while <code>ENDL2</code> outputs 2.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Outputs newlines to <code>stdout</code> (1 if <code>ENDL</code>, 2 if <code>ENDL2</code>).</td>
<td class="org-left">Does not accept or need any arguments.</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
<td class="org-left"><code>ENDL; ENDL2;</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org7fa5351" class="outline-3">
<h3 id="org7fa5351"><span class="section-number-3">5.3.</span> <code>STYLE</code>, <code>FORE</code> and <code>BACK</code></h3>
<div class="outline-text-3" id="text-5-3">
<p>
These 3 keywords all serve the same general purpose: styling text. To better understand them, they&rsquo;ve been split into 3 tables, one for each.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>STYLE</code></th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Applies a style to <code>stdout</code> (lasts until <code>STYLE ?? "RESET_ALL";</code>).</td>
<td class="org-left">Accepts one string argument representing the style to apply (must be one of: <code>DIM</code>, <code>RESET</code>, <code>RESET_ALL</code>, <code>BRIGHT</code>, <code>NORMAL</code>). <code>RESET</code> is the same as <code>RESET_ALL</code>.</td>
<td class="org-left">None</td>
<td class="org-left"><code>ValueError</code> - invalid style argument</td>
<td class="org-left"><code>STYLE ?? "BRIGHT";</code></td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>FORE</code></th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Applies a foreground color to <code>stdout</code> (lasts until <code>STYLE ?? "RESET_ALL";</code> or <code>FORE ?? "RESET";</code>).</td>
<td class="org-left">Accepts one string argument representing the color to apply (must be one of: <code>RESET</code>, <code>BLACK</code>, <code>BLUE</code>, <code>GREEN</code>, <code>YELLOW</code>, <code>MAGENTA</code>, <code>RED</code>, <code>CYAN</code>, <code>WHITE</code>, <code>LIGHTBLACK_EX</code>, <code>LIGHTBLUE_EX</code>, <code>LIGHTGREEN_EX</code>, <code>LIGHTYELLOW_EX</code>, <code>LIGHTMAGENTA_EX</code>, <code>LIGHTRED_EX</code>, <code>LIGHTCYAN_EX</code>, <code>LIGHTWHITE_EX</code>).</td>
<td class="org-left">None</td>
<td class="org-left"><code>ValueError</code> - invalid foreground color argument</td>
<td class="org-left"><code>FORE ?? "YELLOW";</code></td>
</tr>
</tbody>
</table>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><code>BACK</code></th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Applies a background color to <code>stdout</code> (lasts until <code>STYLE ?? "RESET_ALL";</code> or <code>BACK ?? "RESET";</code>).</td>
<td class="org-left">Accepts one string argument representing the color to apply (must be one of: <code>RESET</code>, <code>BLACK</code>, <code>BLUE</code>, <code>GREEN</code>, <code>YELLOW</code>, <code>MAGENTA</code>, <code>RED</code>, <code>CYAN</code>, <code>WHITE</code>, <code>LIGHTBLACK_EX</code>, <code>LIGHTBLUE_EX</code>, <code>LIGHTGREEN_EX</code>, <code>LIGHTYELLOW_EX</code>, <code>LIGHTMAGENTA_EX</code>, <code>LIGHTRED_EX</code>, <code>LIGHTCYAN_EX</code>, <code>LIGHTWHITE_EX</code>).</td>
<td class="org-left">None</td>
<td class="org-left"><code>ValueError</code> - invalid background color argument</td>
<td class="org-left"><code>BACK ?? "LIGHTBLUE_EX";</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org58ce561" class="outline-3">
<h3 id="org58ce561"><span class="section-number-3">5.4.</span> <code>TERMINATE</code> (0/1 argument overload)</h3>
<div class="outline-text-3" id="text-5-4">
<p>
This is the keyword responsible for terminating the script safely instead of waiting for the end of the file.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Terminates the execution of the current CX Setup script.</td>
<td class="org-left"><code>ExitCode</code> - optional integer, defaults to 0</td>
<td class="org-left">None</td>
<td class="org-left"><code>TypeError</code> - <code>ExitCode</code> is not an integer</td>
<td class="org-left"><code>TERMINATE ?? 4; // error code 4</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgb650a97" class="outline-3">
<h3 id="orgb650a97"><span class="section-number-3">5.5.</span> <code>TERMINATE</code> (2 arguments overload - v2.0.0+)</h3>
<div class="outline-text-3" id="text-5-5">
<p>
New in v2.0.0, this overload of <code>TERMINATE</code> allows for more verbosity.
</p>

<p>
It can be given a custom exit message that will be shown if the <code>ExitCode</code> is <b>not</b> 0.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Terminates the execution of the current CX Setup script.</td>
<td class="org-left"><code>ExitCode</code> - integer; <code>CustomMessage</code> - string;</td>
<td class="org-left">None</td>
<td class="org-left"><code>TypeError</code> - <code>ExitCode</code> is not an integer / <code>CustomMessage</code> is not a string/char</td>
<td class="org-left"><code>TERMINATE ?? 4 ?? "Something unexpected happened!"; // error code 4</code></td>
</tr>
</tbody>
</table>
</div>
</div>
