documentation/cxsetup/cxsetup_2.0.html
<div id="outline-container-org2404d3f" class="outline-3">
<h3 id="org2404d3f"><span class="section-number-3">5.6.</span> <code>CIN</code> (0 arguments overload)</h3>
<div class="outline-text-3" id="text-5-6">
<p>
This is the overload of <code>CIN</code> that requires no arguments.
</p>

<p>
<code>CIN</code> is the most basic tool for getting input from the user (more specifically, <code>stdin</code>).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Reads input from the user (<code>stdin</code>).</td>
<td class="org-left">This is the 0 arguments overload. For the other overloads, look up <code>CIN (x arguments overload)</code> in the <b>Table of Contents</b>, where <code>x</code> is either 0, 1 or 2.</td>
<td class="org-left">The user input.</td>
<td class="org-left">None</td>
<td class="org-left"><code>CIN; // this will get input from the user</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf9f6ccb" class="outline-3">
<h3 id="orgf9f6ccb"><span class="section-number-3">5.7.</span> <code>CIN</code> (1 argument overload)</h3>
<div class="outline-text-3" id="text-5-7">
<p>
This is the overload of <code>CIN</code> that requires 1 argument.
</p>

<p>
Sometimes, you might need to set a character limit on a user&rsquo;s input. That way, even if they type more than that, only the first <code>x</code> characters actually get cached.
</p>

<div class="org-center">
<p>
If the character limit is set to <b>0 or a negative number</b>, it will be ignored and it&rsquo;ll be the same as calling <code>CIN</code> with no arguments at all.
</p>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Reads input from the user (<code>stdin</code>), while applying a character limit.</td>
<td class="org-left"><code>CharLimit</code> - integer, the character limit to apply</td>
<td class="org-left">The user input, with the character limit applied if greater than 0.</td>
<td class="org-left">None</td>
<td class="org-left"><code>CIN ?? 4; // this will cache the first 4 characters of the user's input</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgf6cb061" class="outline-3">
<h3 id="orgf6cb061"><span class="section-number-3">5.8.</span> <code>RUN</code></h3>
<div class="outline-text-3" id="text-5-8">
<p>
Given CXSetup is used in ContenterX&rsquo;s setup scripts, it&rsquo;s kind of an obligation for it to allow the creator of the script to <b>run sub-processes</b> programatically.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Runs a command with arguments (optional).</td>
<td class="org-left">At least 1 argument must be given. The first argument is the <b>command/process</b> and the others are the arguments. Split the process&rsquo;s arguments across different <code>RUN</code> arguments.</td>
<td class="org-left">None</td>
<td class="org-left"><code>InternalError</code> - split process arguments across different arguments (see below)</td>
<td class="org-left"><code>RUN ?? "sudo" ?? "apt" ?? "install" ?? "emacs"; // this will install Emacs. If you're root, that is :)</code></td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-org3550942" class="outline-4">
<h4 id="org3550942"><span class="section-number-4">5.8.1.</span> The Number 1 cause of error when using <code>RUN</code></h4>
<div class="outline-text-4" id="text-5-8-1">
<p>
The following statements are all incorrect:
</p>
<div class="org-src-container">
<pre class="src src-nil">RUN ?? "sudo apt install emacs";
RUN ?? "sudo" ?? "apt install emacs";
RUN ?? "sudo apt" ?? "install emacs";
RUN ?? "sudo" ?? "apt" ?? "install emacs";
RUN ?? "sudo" ?? "apt install" ?? "emacs";
RUN ?? "sudo apt install" ? "emacs";
</pre>
</div>

<p>
The reason for it is that arguments for the process must be split across arguments for <code>RUN</code>.
</p>

<p>
The correct way to do this installation would be:
</p>
<div class="org-src-container">
<pre class="src src-nil">RUN ?? "sudo" ?? "apt" ?? "install" ?? "emacs";
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge130f5f" class="outline-3">
<h3 id="orge130f5f"><span class="section-number-3">5.9.</span> <code>CIN</code> (2 arguments overload)</h3>
<div class="outline-text-3" id="text-5-9">
<p>
This is the overload of <code>CIN</code> that requires 2 arguments.
</p>

<p>
Other than setting a character limit, this overload also allows you to set a custom prompt message for the input.
</p>

<p>
The only disadvantage is that applying a character limit becomes mandatory. However, you can get past that due to how the character limit works.
</p>

<div class="org-center">
<p>
If the character limit is <b>0 or a negative number</b>, no limit will be applied.
</p>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Reads input from the user (<code>stdin</code>), while applying a character limit (if applicable) and using a custom prompt message.</td>
<td class="org-left"><code>CharLimit</code> - integer; <code>PromptMessage</code> - string, the custom prompt message to use</td>
<td class="org-left">The user input, with the character limit applied if greater than 0.</td>
<td class="org-left">None</td>
<td class="org-left"><code>CIN ?? 4 ?? "Only 4 characters please: ";</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org0659034" class="outline-3">
<h3 id="org0659034"><span class="section-number-3">5.10.</span> <code>GETPASS</code></h3>
<div class="outline-text-3" id="text-5-10">
<p>
Sometimes, you may need to be more discreet with your inputs. For example, it&rsquo;s not really a great idea to get <b>passwords</b> with <code>CIN</code>, since it shows what is being typed.
</p>

<p>
<code>GETPASS</code> solves such issue. With this keyword, you can safely get passwords without showing them on screen. This keyword&rsquo;s only limitation is, unironically, the fact it cannot be limited to a certain number of characters (any amount is accepted).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Reads input from the user (<code>stdin</code>) with <code>echo</code> disabled, meaning it does not show on screen what is being typed by the user.</td>
<td class="org-left"><code>PromptMessage</code> - mandatory string, the custom prompt message to use</td>
<td class="org-left">The user input.</td>
<td class="org-left">None</td>
<td class="org-left"><code>GETPASS ?? "Insert your password, please: ";</code></td>
</tr>
</tbody>
</table>
</div>
</div>
