documentation/cxsetup/cxsetup_2.0.org
** =SAFECIN= (1 argument overload)
=CIN= has yet another big issue: when it is given a character limit, it makes sure the input doesn't go beyond the limit. However, it does *not* make sure the input has the specified length.

This might not seem problematic, but it becomes when *cache grabs* are involved. Cache grabs will be a matter of discussing later, due to their complexity. However, here is a small representation of the issue.

#+begin_src bash
>>> CIN ?? 4 ?? "Your input please: ";
Your input please: Good
>>> COUT ?? c0:4l:1:3:n;
Good
#+end_src

No issue at first. Well let's move on to the second example.
#+begin_src bash
>>> CIN ?? 4 ?? "Input: ";
Input: Ok
>>> COUT ?? c0:4l:1:3:n;
Ok
>>> CIN ?? 1 ?? "Input: ";
Input: A
>>> COUT ?? c0:4l:1:3:n;
OkA
#+end_src

Now, imagine the first input was done to ask for the path of a very important file. But, before the file is used, another input is done.

Now, CXSetup would think the file is named =OkA=, when it is actually named =Ok=.

To avoid this issue, we can safely use =SAFECIN=. To make sure the input is as long as we want it to be, =SAFECIN= pads the right of the input with spaces (if necessary) until the length of the input matches.

Then, when doing the cache grab, we can trim the spaces if necessary.

Here's our example, but /refined/. To better illustrate it, the meaningful whitespace characters have been represented as ~[SPACE]~.
#+begin_src bash
>>> SAFECIN ?? 4;
An input is required (press Enter to ignore it): Ok
>>> CIN;
An input is required (press Enter to ignore it): A
>>> COUT ?? c0:4l:1:3:n;
Ok[SPACE][SPACE]
>> COUT ?? c0:4l:1:3:b; // the little b means trim both sides - we'll talk about it soon
Ok
#+end_src

| Summary                                                                                         | Arguments                                | Returns                                             | Exceptions | Example       |
|-------------------------------------------------------------------------------------------------+------------------------------------------+-----------------------------------------------------+------------+---------------|
| Reads input from the user (~stdin~), making sure its length matches the character limit we apply. | ~CharLimit~ - integer, length of the input | The user input, with length matching the ~CharLimit~. | None       | =SAFECIN ?? 4;= |

** =SAFECIN= (2 arguments overload)
Sometimes, it might also be useful to specify exactly what input must be given.

For example, which of these scenarios is clearer from the user side (a.k.a. by someone who doesn't see the underlying script), A or B?

*Scenario A:*
#+begin_src bash
Your input, please:
#+end_src

*Scenario B:*
#+begin_src bash
Please insert a valid path to the configuration file:
#+end_src

| Summary                                                                                                                                    | Arguments                                                                           | Returns                                             | Exceptions | Example                                   |
|--------------------------------------------------------------------------------------------------------------------------------------------+-------------------------------------------------------------------------------------+-----------------------------------------------------+------------+-------------------------------------------|
| Reads input from the user (~stdin~), making sure its length matches the character limit we apply. Is compatible with custom prompt messages. | ~CharLimit~ - integer; ~PromptMessage~ - string, the prompt message to show to the user | The user input, with length matching the ~CharLimit~. | None       | =SAFECIN ?? 8 ?? "Your username please: ";= |

** =ECHO=
#+begin_quote
~ECHO~ does not write to the screen by default. It is used to write to a file instead. If you wish to output to ~stdout~, please use [[=COUT=][the =COUT= keyword]].
#+end_quote

Another useful feature in a scripting language is the ability to write to a file. Even though =ECHO= is limited, it is still a very good option when it comes to writing to files.

Note that *=ECHO= does not overwrite files*. In fact, there are 2 special cases and a more generic one:
1. *Generic Case:* =ECHO= successfully writes to a file.
2. *~FileExistsError~:* =ECHO= fails and throws an Exception. This happens if the file already exists.
3. *Reverts to =COUT=:* Yes, in theory, you /can/ use =ECHO= instead of =COUT=, if you give =ECHO= an empty string instead of an actual file path. However, it's not really that good of an idea.

| Summary                                                                      | Arguments                                                                                                                             | Returns | Exceptions                        | Example                                 |
|------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------+---------+-----------------------------------+-----------------------------------------|
| Writes to a file or reverts back to =COUT= if the file path is an empty string. | ~DataToWrite~ - string, the data to write; ~FilePath~ - string, the file path to write to (if empty, reverts back to =COUT ?? /DataToWrite/;=) | None    | ~FileExistsError~ - the file exists | =ECHO ?? "Hello, World!" ?? "hello.txt";= |

** =ECHORDIE=
A more extreme version of =ECHO=, this one is fine with the possibility of overwriting files. Due to this fact, it ought to be used carefully.

| Summary                                                                      | Arguments                                                                                                                             | Returns | Exceptions | Example                                 |
|------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------+---------+------------+-----------------------------------------|
| Writes to a file or reverts back to =COUT= if the file path is an empty string. | ~DataToWrite~ - string, the data to write; ~FilePath~ - string, the file path to write to (if empty, reverts back to =COUT ?? /DataToWrite/;=) | None    | None       | =ECHO ?? "Hello, World!" ?? "hello.txt";= |

