documentation/cxsetup/cxsetup_2.0.html
<div id="outline-container-orga9025d4" class="outline-3">
<h3 id="orga9025d4"><span class="section-number-3">5.11.</span> <code>SAFECIN</code> (1 argument overload)</h3>
<div class="outline-text-3" id="text-5-11">
<p>
<code>CIN</code> has yet another big issue: when it is given a character limit, it makes sure the input doesn&rsquo;t go beyond the limit. However, it does <b>not</b> make sure the input has the specified length.
</p>

<p>
This might not seem problematic, but it becomes when <b>cache grabs</b> are involved. Cache grabs will be a matter of discussing later, due to their complexity. However, here is a small representation of the issue.
</p>

<div class="org-src-container">
<pre class="src src-bash">&gt;&gt;&gt; CIN ?? <span style="color: #ffd400; font-weight: bold;">4</span> ?? <span style="color: #7984D1;">"Your input please: "</span>;
Your input please: Good
&gt;&gt;&gt; COUT ?? c0:4l:1:3:n;
Good
</pre>
</div>

<p>
No issue at first. Well let&rsquo;s move on to the second example.
</p>
<div class="org-src-container">
<pre class="src src-bash">&gt;&gt;&gt; CIN ?? <span style="color: #ffd400; font-weight: bold;">4</span> ?? <span style="color: #7984D1;">"Input: "</span>;
Input: Ok
&gt;&gt;&gt; COUT ?? c0:4l:1:3:n;
Ok
&gt;&gt;&gt; CIN ?? <span style="color: #ffd400; font-weight: bold;">1</span> ?? <span style="color: #7984D1;">"Input: "</span>;
Input: A
&gt;&gt;&gt; COUT ?? c0:4l:1:3:n;
OkA
</pre>
</div>

<p>
Now, imagine the first input was done to ask for the path of a very important file. But, before the file is used, another input is done.
</p>

<p>
Now, CXSetup would think the file is named <code>OkA</code>, when it is actually named <code>Ok</code>.
</p>

<p>
To avoid this issue, we can safely use <code>SAFECIN</code>. To make sure the input is as long as we want it to be, <code>SAFECIN</code> pads the right of the input with spaces (if necessary) until the length of the input matches.
</p>

<p>
Then, when doing the cache grab, we can trim the spaces if necessary.
</p>

<p>
Here&rsquo;s our example, but <i>refined</i>. To better illustrate it, the meaningful whitespace characters have been represented as <code>[SPACE]</code>.
</p>
<div class="org-src-container">
<pre class="src src-bash">&gt;&gt;&gt; SAFECIN ?? <span style="color: #ffd400; font-weight: bold;">4</span>;
An input is required (press Enter to ignore it): Ok
&gt;&gt;&gt; CIN;
An input is required (press Enter to ignore it): A
&gt;&gt;&gt; COUT ?? c0:4l:1:3:n;
Ok[SPACE][SPACE]
&gt;&gt; COUT ?? c0:4l:1:3:b; // the little b means trim both sides - we<span style="color: #7984D1;">'ll talk about it soon</span>
<span style="color: #7984D1;">Ok</span>
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Reads input from the user (<code>stdin</code>), making sure its length matches the character limit we apply.</td>
<td class="org-left"><code>CharLimit</code> - integer, length of the input</td>
<td class="org-left">The user input, with length matching the <code>CharLimit</code>.</td>
<td class="org-left">None</td>
<td class="org-left"><code>SAFECIN ?? 4;</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org2bf3de1" class="outline-3">
<h3 id="org2bf3de1"><span class="section-number-3">5.12.</span> <code>SAFECIN</code> (2 arguments overload)</h3>
<div class="outline-text-3" id="text-5-12">
<p>
Sometimes, it might also be useful to specify exactly what input must be given.
</p>

<p>
For example, which of these scenarios is clearer from the user side (a.k.a. by someone who doesn&rsquo;t see the underlying script), A or B?
</p>

<p>
<b>Scenario A:</b>
</p>
<div class="org-src-container">
<pre class="src src-bash">Your input, please:
</pre>
</div>

<p>
<b>Scenario B:</b>
</p>
<div class="org-src-container">
<pre class="src src-bash">Please insert a valid path to the configuration file:
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Reads input from the user (<code>stdin</code>), making sure its length matches the character limit we apply. Is compatible with custom prompt messages.</td>
<td class="org-left"><code>CharLimit</code> - integer; <code>PromptMessage</code> - string, the prompt message to show to the user</td>
<td class="org-left">The user input, with length matching the <code>CharLimit</code>.</td>
<td class="org-left">None</td>
<td class="org-left"><code>SAFECIN ?? 8 ?? "Your username please: ";</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga9ee762" class="outline-3">
<h3 id="orga9ee762"><span class="section-number-3">5.13.</span> <code>ECHO</code></h3>
<div class="outline-text-3" id="text-5-13">
<blockquote>
<p>
<code>ECHO</code> does not write to the screen by default. It is used to write to a file instead. If you wish to output to <code>stdout</code>, please use <a href="#orgf2272af">the <code>COUT</code> keyword</a>.
</p>
</blockquote>

<p>
Another useful feature in a scripting language is the ability to write to a file. Even though <code>ECHO</code> is limited, it is still a very good option when it comes to writing to files.
</p>

<p>
Note that <b><code>ECHO</code> does not overwrite files</b>. In fact, there are 2 special cases and a more generic one:
</p>
<ol class="org-ol">
<li><b>Generic Case:</b> <code>ECHO</code> successfully writes to a file.</li>
<li><b><code>FileExistsError</code>:</b> <code>ECHO</code> fails and throws an Exception. This happens if the file already exists.</li>
<li><b>Reverts to <code>COUT</code>:</b> Yes, in theory, you <i>can</i> use <code>ECHO</code> instead of <code>COUT</code>, if you give <code>ECHO</code> an empty string instead of an actual file path. However, it&rsquo;s not really that good of an idea.</li>
</ol>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Writes to a file or reverts back to <code>COUT</code> if the file path is an empty string.</td>
<td class="org-left"><code>DataToWrite</code> - string, the data to write; <code>FilePath</code> - string, the file path to write to (if empty, reverts back to <code>COUT ?? /DataToWrite/;</code>)</td>
<td class="org-left">None</td>
<td class="org-left"><code>FileExistsError</code> - the file exists</td>
<td class="org-left"><code>ECHO ?? "Hello, World!" ?? "hello.txt";</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org18db1ec" class="outline-3">
<h3 id="org18db1ec"><span class="section-number-3">5.14.</span> <code>ECHORDIE</code></h3>
<div class="outline-text-3" id="text-5-14">
<p>
A more extreme version of <code>ECHO</code>, this one is fine with the possibility of overwriting files. Due to this fact, it ought to be used carefully.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Writes to a file or reverts back to <code>COUT</code> if the file path is an empty string.</td>
<td class="org-left"><code>DataToWrite</code> - string, the data to write; <code>FilePath</code> - string, the file path to write to (if empty, reverts back to <code>COUT ?? /DataToWrite/;</code>)</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
<td class="org-left"><code>ECHO ?? "Hello, World!" ?? "hello.txt";</code></td>
</tr>
</tbody>
</table>
</div>
</div>
