documentation/cxsetup/cxsetup_2.0.org
** =PIPRUN=, =PKGRUN=, =NPMRUN=
The main issue with =RUN= is the fact it ends up *hardcoding* values.

For example:
#+begin_src bash
RUN ?? "pip" ?? "install" ?? "simple_webbrowser";
#+end_src

What if we want the system to tells us exactly what version of ~pip~, ~npm~ or the package manager to use?
The solution is extremely easy.
#+begin_src bash
PIPRUN ?? "install" ?? "simple_webbrowser";
#+end_src

All of these work essentially the same way as =RUN= (they're wrappers), so their tables have been omitted (see [[=RUN=][the =RUN= command]] for more information).

** =REQUIRES=
Another important thing when it comes to installing software are requirements!

Note that =REQUIRES= merely defines requirements, it does not install them.

Due to the slight complexity of one of its arguments, instead of just showing the table we'll also show a demonstration with comments.
#+begin_src bash
>>> REQUIRES ?? 0 ?? "neofetch"; // the 0 stands for "Install using system package manager"
>>> REQUIRES ?? 0 ?? "cowsay"; // worth mentioning the command does not output anything or install anything
>>> REQUIRES ?? 1 ?? "MF366-Coding/WPlugZ-CLI"; // the 1 uses ContenterX itself to install ("Install using ContenterX")
>>> REQUIRES ?? 2 ?? "NCapybaraLib"; // the 2 stands for "Install using pip"
>>> REQUIRES ?? 3 ?? "express"; // source number 3 stands for "Install using npm"
>>> REQUIRES ?? 4 ?? "https://github.com/MF366-Coding/WriterClassic/releases/download/v11.0.0/WriterClassic_v11.0.0_SetupWizard_x64.exe"; // source number 4 stands for "Get binary from a direct link" - you'll be using this a lot in Windows
>>> REQUIRES ?? 5 ?? "sl"; // this is a ValueError - only sources [0,4] are available
#+end_src

So, in summary:
| First Argument | Meaning                                        |
|----------------+------------------------------------------------|
|              0 | Install using the system's package manager.    |
|              1 | Install using ContenterX.                      |
|              2 | Install using ~pip.~                              |
|              3 | Install using ~npm~.                             |
|              4 | Download a binary via a direct link.           |
|  Anything else | ~ValueError~: only sources 0 to 4 are available. |

--------------------------------------

| Summary                                                  | Arguments                                                                                                                  | Returns | Exceptions                     | Example                      |
|----------------------------------------------------------+----------------------------------------------------------------------------------------------------------------------------+---------+--------------------------------+------------------------------|
| Marks something as a dependency but does not install it. | ~Source~ - integer, the /source/ to use; ~DependencyName~ - string, the name of the dependency (or its link if the ~Source~ is ~4~). | None    | ~ValueError~ - invalid source ID | =REQUIRES ?? 0 ?? "neofetch";= |

** =REQINSTALL=
After marking all the dependencies you need, it's time to install them. And that's exactly what this command does. Now, you can call =REQINSTALL= more than once in the same script, but keep in mind that after each call, the list of dependencies is wiped clean.

| Summary                                  | Arguments | Returns | Exceptions                                                             | Example     |
|------------------------------------------+-----------+---------+------------------------------------------------------------------------+-------------|
| Installs previously marked dependencies. | None      | None    | ~SyntaxError~ - =REQINSTALL= takes 0 arguments, but more than 0 were given | =REQINSTALL;= |

* Cache
We have not discussed all keywords yet, but they operate on something slightly more complex: *cache*.

Instead of variables, in CXSetup, you have cache. We've already discussed certain commands that modify it (such as =CIN=), but what more can be done with it?

