documentation/cxsetup/cxsetup_2.0.html
<div id="outline-container-org90caf46" class="outline-3">
<h3 id="org90caf46"><span class="section-number-3">5.15.</span> <code>PIPRUN</code>, <code>PKGRUN</code>, <code>NPMRUN</code></h3>
<div class="outline-text-3" id="text-5-15">
<p>
The main issue with <code>RUN</code> is the fact it ends up <b>hardcoding</b> values.
</p>

<p>
For example:
</p>
<div class="org-src-container">
<pre class="src src-bash">RUN ?? <span style="color: #7984D1;">"pip"</span> ?? <span style="color: #7984D1;">"install"</span> ?? <span style="color: #7984D1;">"simple_webbrowser"</span>;
</pre>
</div>

<p>
What if we want the system to tells us exactly what version of <code>pip</code>, <code>npm</code> or the package manager to use?
The solution is extremely easy.
</p>
<div class="org-src-container">
<pre class="src src-bash">PIPRUN ?? <span style="color: #7984D1;">"install"</span> ?? <span style="color: #7984D1;">"simple_webbrowser"</span>;
</pre>
</div>

<p>
All of these work essentially the same way as <code>RUN</code> (they&rsquo;re wrappers), so their tables have been omitted (see <a href="#orgf6cb061">the <code>RUN</code> command</a> for more information).
</p>
</div>
</div>
<div id="outline-container-org2cea8c0" class="outline-3">
<h3 id="org2cea8c0"><span class="section-number-3">5.16.</span> <code>REQUIRES</code></h3>
<div class="outline-text-3" id="text-5-16">
<p>
Another important thing when it comes to installing software are requirements!
</p>

<p>
Note that <code>REQUIRES</code> merely defines requirements, it does not install them.
</p>

<p>
Due to the slight complexity of one of its arguments, instead of just showing the table we&rsquo;ll also show a demonstration with comments.
</p>
<div class="org-src-container">
<pre class="src src-bash">&gt;&gt;&gt; REQUIRES ?? <span style="color: #ffd400; font-weight: bold;">0</span> ?? <span style="color: #7984D1;">"neofetch"</span>; // the <span style="color: #ffd400; font-weight: bold;">0</span> stands for <span style="color: #7984D1;">"Install using system package manager"</span>
&gt;&gt;&gt; REQUIRES ?? <span style="color: #ffd400; font-weight: bold;">0</span> ?? <span style="color: #7984D1;">"cowsay"</span>; // worth mentioning the command does not output anything or install anything
&gt;&gt;&gt; REQUIRES ?? <span style="color: #ffd400; font-weight: bold;">1</span> ?? <span style="color: #7984D1;">"MF366-Coding/WPlugZ-CLI"</span>; // the <span style="color: #ffd400; font-weight: bold;">1</span> uses ContenterX itself to install (<span style="color: #7984D1;">"Install using ContenterX"</span>)
&gt;&gt;&gt; REQUIRES ?? <span style="color: #ffd400; font-weight: bold;">2</span> ?? <span style="color: #7984D1;">"NCapybaraLib"</span>; // the <span style="color: #ffd400; font-weight: bold;">2</span> stands for <span style="color: #7984D1;">"Install using pip"</span>
&gt;&gt;&gt; REQUIRES ?? <span style="color: #ffd400; font-weight: bold;">3</span> ?? <span style="color: #7984D1;">"express"</span>; // source number <span style="color: #ffd400; font-weight: bold;">3</span> stands for <span style="color: #7984D1;">"Install using npm"</span>
&gt;&gt;&gt; REQUIRES ?? <span style="color: #ffd400; font-weight: bold;">4</span> ?? <span style="color: #7984D1;">"https://github.com/MF366-Coding/WriterClassic/releases/download/v11.0.0/WriterClassic_v11.0.0_SetupWizard_x64.exe"</span>; // source number <span style="color: #ffd400; font-weight: bold;">4</span> stands for <span style="color: #7984D1;">"Get binary from a direct link"</span> - you<span style="color: #7984D1;">'ll be using this a lot in Windows</span>
<span style="color: #7984D1;">&gt;&gt;&gt; REQUIRES ?? 5 ?? "sl"; // this is a ValueError - only sources [0,4] are available</span>
</pre>
</div>

<p>
So, in summary:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">First Argument</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Install using the system&rsquo;s package manager.</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Install using ContenterX.</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Install using <code>pip.</code></td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Install using <code>npm</code>.</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Download a binary via a direct link.</td>
</tr>

<tr>
<td class="org-right">Anything else</td>
<td class="org-left"><code>ValueError</code>: only sources 0 to 4 are available.</td>
</tr>
</tbody>
</table>

<hr />

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Marks something as a dependency but does not install it.</td>
<td class="org-left"><code>Source</code> - integer, the <i>source</i> to use; <code>DependencyName</code> - string, the name of the dependency (or its link if the <code>Source</code> is <code>4</code>).</td>
<td class="org-left">None</td>
<td class="org-left"><code>ValueError</code> - invalid source ID</td>
<td class="org-left"><code>REQUIRES ?? 0 ?? "neofetch";</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgcc9485b" class="outline-3">
<h3 id="orgcc9485b"><span class="section-number-3">5.17.</span> <code>REQINSTALL</code></h3>
<div class="outline-text-3" id="text-5-17">
<p>
After marking all the dependencies you need, it&rsquo;s time to install them. And that&rsquo;s exactly what this command does. Now, you can call <code>REQINSTALL</code> more than once in the same script, but keep in mind that after each call, the list of dependencies is wiped clean.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Installs previously marked dependencies.</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
<td class="org-left"><code>SyntaxError</code> - <code>REQINSTALL</code> takes 0 arguments, but more than 0 were given</td>
<td class="org-left"><code>REQINSTALL;</code></td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="outline-container-org800da90" class="outline-2">
<h2 id="org800da90"><span class="section-number-2">6.</span> Cache</h2>
<div class="outline-text-2" id="text-6">
<p>
We have not discussed all keywords yet, but they operate on something slightly more complex: <b>cache</b>.
</p>

<p>
Instead of variables, in CXSetup, you have cache. We&rsquo;ve already discussed certain commands that modify it (such as <code>CIN</code>), but what more can be done with it?
</p>
</div>
