documentation/cxsetup/cxsetup_2.0.org
** Reading
There's a whole new syntax when it comes to accessing caches. Its official name is *cache grabbing*.

A cache grab can have any data type, since it does not matter which command saved the cache.

For example, you can do a =CIN= operation, which saves a *string*. But that hardly matters, because you can access that same cache as if it were an integer.

The syntax for cache grabs is the following and can be used as arguments for keywords:
#+begin_src
AB:CD:E:F:G
#+end_src

So what does each letter stand for? Let's see:
- *A:* this must always be set to a lowercase *C* (~c~).
- *B:* an integer. This is used as the start index for the cache grab. For example, ~0~ in this case means *start from the beginning*.
- *C:* an integer. Can be an *end index* or the *length of the cache grab*. For example, ~5~ can either mean *end at the index before 5 (4)* or *end 5 bytes after the starting index (with 0 as the starting index, it would be 5)*.
- *D:* a single character, must be one of ~l~ or ~e~. This is the value that decides whether value *C* is interpreted as the *end index* (~e~) or the *length of the cache grab* (~l~).
- *E:* an integer. Represents the *step value*. This represents the pattern to perform. Let's say we're cache grabbing ~Hello, World!~. Using a *step value* of 1 (default), we'd get ~Hello, World!~ but a *step value of 2* would give us the same string, but skipping each odd-indexed character (indexing starts at 0). So, ~Hlo ol!~.
- *F:* an integer. Represents the data type the cache grab must be casted as. (See table below.)
- *G:* a single character, must be one of ~b~, ~r~, ~l~, ~n~. This value must always be set to ~n~ if we're not dealing with cache grabbed strings. If it's strings we're dealing with, however, we can use this value to decide whether spaces should be trimmed or not (~n~ is trim none), and from what direction (~r~ is trim right, ~l~ is trim left and ~b~ is trim both sides). This is useful when used alongside =SAFECIN=, for example (since it pads the input with spaces).

Here's an example:
#+begin_src bash
>>> SAFECIN ?? 6 ?? "6 characters only please: ";
6 characters only please: Hello!
>>> COUT ?? c0:6l:1:3:b; // the first 6 characters, no pattern, output as string, trim both sides
Hello!
#+end_src

| *D* Value (Interpret Value *C* as) | Meaning                                        |
|--------------------------------+------------------------------------------------|
| ~l~                              | *Length of the cache grab.*                      |
| ~e~                              | *End index.*                                     |
| Anything Else                  | ~ValueError~: only ~l~ and ~e~ are allowed as values |

--------------------------

| *F* Value (Data Type Conversion) | Meaning                                                                                                                     |
|-------------------------------+-----------------------------------------------------------------------------------------------------------------------------|
|                             0 | *Void* - incompatible, will throw an error.                                                                                   |
|                             1 | *Integer* - a whole number                                                                                                    |
|                             2 | *Floating point* - requires *EXACTLY* 4 bytes for a successful cache grab conversion. Any more or any less will throw an error. |
|                             3 | *String*                                                                                                                      |
|                             4 | *Boolean* - a True or False value. If the bytes are not empty, it will *ALWAYS* be True.                                        |
|                             5 | *Single Character* - a single character, not widely used                                                                      |
|                            6+ | *Bytes/Garbage Values* - the bytes themselves - not widely used                                                               |
|                   -1 or lower | ~ValueError~: only positive values are allowed                                                                                |

-------------------------

| *G* Value (Trim Direction) | Meaning                                                                                                     |
|--------------------------+-------------------------------------------------------------------------------------------------------------|
| ~n~                        | *Don't trim.* IF dealing with anything other than strings, this is the only option that won't raise an error. |
| ~l~                        | *Trim left.* Trim whitespace characters to the left of the string.                                            |
| ~r~                        | *Trim right.* Trim whitespace characters to the right of the string.                                          |
| ~b~                        | *Trim both sides.* Trim whitespace characters at both ends of the string.                                     |
| Anything Else            | ~ValueError~: only ~n~, ~l~, ~r~ and ~b~ are allowed as values                                                        |

** Writing
Writing can only be done through keywords, albeit in 2 different ways:
- *Directly:* A direct modification involves the script creator themselves using a method that does not require any sort of confirmation from the user when it comes to modifying the cache.
- *Indirectly:* An indirect modification involves obtaining input from the user or the environment.

*** Keywords that Write to the Cache Directly
- [[=CLEAR=][*=CLEAR=*]] - clears the cache
- [[=SET=][*=SET=*]] - writes to the cache
- [[Mathematical Operations (v2.0.0+)][*All Mathematical Operations* (new in version 2)]] - all of them write the result to the cache

**** =CLEAR=
This command clears the cache (fills it with empty bytes).

| Summary           | Arguments | Returns | Exceptions                                                        | Example |
|-------------------+-----------+---------+-------------------------------------------------------------------+---------|
| Clears the cache. | None      | None    | ~SyntaxError~ - =CLEAR= takes 0 arguments, but more than 0 were given | =CLEAR;=  |

