documentation/cxsetup/cxsetup_2.0.html
<div id="outline-container-orgf762dec" class="outline-3">
<h3 id="orgf762dec"><span class="section-number-3">6.1.</span> Reading</h3>
<div class="outline-text-3" id="text-6-1">
<p>
There&rsquo;s a whole new syntax when it comes to accessing caches. Its official name is <b>cache grabbing</b>.
</p>

<p>
A cache grab can have any data type, since it does not matter which command saved the cache.
</p>

<p>
For example, you can do a <code>CIN</code> operation, which saves a <b>string</b>. But that hardly matters, because you can access that same cache as if it were an integer.
</p>

<p>
The syntax for cache grabs is the following and can be used as arguments for keywords:
</p>
<div class="org-src-container">
<pre class="src src-nil">AB:CD:E:F:G
</pre>
</div>

<p>
So what does each letter stand for? Let&rsquo;s see:
</p>
<ul class="org-ul">
<li><b>A:</b> this must always be set to a lowercase <b>C</b> (<code>c</code>).</li>
<li><b>B:</b> an integer. This is used as the start index for the cache grab. For example, <code>0</code> in this case means <b>start from the beginning</b>.</li>
<li><b>C:</b> an integer. Can be an <b>end index</b> or the <b>length of the cache grab</b>. For example, <code>5</code> can either mean <b>end at the index before 5 (4)</b> or <b>end 5 bytes after the starting index (with 0 as the starting index, it would be 5)</b>.</li>
<li><b>D:</b> a single character, must be one of <code>l</code> or <code>e</code>. This is the value that decides whether value <b>C</b> is interpreted as the <b>end index</b> (<code>e</code>) or the <b>length of the cache grab</b> (<code>l</code>).</li>
<li><b>E:</b> an integer. Represents the <b>step value</b>. This represents the pattern to perform. Let&rsquo;s say we&rsquo;re cache grabbing <code>Hello, World!</code>. Using a <b>step value</b> of 1 (default), we&rsquo;d get <code>Hello, World!</code> but a <b>step value of 2</b> would give us the same string, but skipping each odd-indexed character (indexing starts at 0). So, <code>Hlo ol!</code>.</li>
<li><b>F:</b> an integer. Represents the data type the cache grab must be casted as. (See table below.)</li>
<li><b>G:</b> a single character, must be one of <code>b</code>, <code>r</code>, <code>l</code>, <code>n</code>. This value must always be set to <code>n</code> if we&rsquo;re not dealing with cache grabbed strings. If it&rsquo;s strings we&rsquo;re dealing with, however, we can use this value to decide whether spaces should be trimmed or not (<code>n</code> is trim none), and from what direction (<code>r</code> is trim right, <code>l</code> is trim left and <code>b</code> is trim both sides). This is useful when used alongside <code>SAFECIN</code>, for example (since it pads the input with spaces).</li>
</ul>

<p>
Here&rsquo;s an example:
</p>
<div class="org-src-container">
<pre class="src src-bash">&gt;&gt;&gt; SAFECIN ?? <span style="color: #ffd400; font-weight: bold;">6</span> ?? <span style="color: #7984D1;">"6 characters only please: "</span>;
<span style="color: #ffd400; font-weight: bold;">6</span> characters only please: Hello!
&gt;&gt;&gt; COUT ?? c0:6l:1:3:b; // the first <span style="color: #ffd400; font-weight: bold;">6</span> characters, no pattern, output as string, trim both sides
Hello!
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>D</b> Value (Interpret Value <b>C</b> as)</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>l</code></td>
<td class="org-left"><b>Length of the cache grab.</b></td>
</tr>

<tr>
<td class="org-left"><code>e</code></td>
<td class="org-left"><b>End index.</b></td>
</tr>

<tr>
<td class="org-left">Anything Else</td>
<td class="org-left"><code>ValueError</code>: only <code>l</code> and <code>e</code> are allowed as values</td>
</tr>
</tbody>
</table>

<hr />

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right"><b>F</b> Value (Data Type Conversion)</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left"><b>Void</b> - incompatible, will throw an error.</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left"><b>Integer</b> - a whole number</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left"><b>Floating point</b> - requires <b>EXACTLY</b> 4 bytes for a successful cache grab conversion. Any more or any less will throw an error.</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left"><b>String</b></td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left"><b>Boolean</b> - a True or False value. If the bytes are not empty, it will <b>ALWAYS</b> be True.</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left"><b>Single Character</b> - a single character, not widely used</td>
</tr>

<tr>
<td class="org-right">6+</td>
<td class="org-left"><b>Bytes/Garbage Values</b> - the bytes themselves - not widely used</td>
</tr>

<tr>
<td class="org-right">-1 or lower</td>
<td class="org-left"><code>ValueError</code>: only positive values are allowed</td>
</tr>
</tbody>
</table>

<hr />

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left"><b>G</b> Value (Trim Direction)</th>
<th scope="col" class="org-left">Meaning</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>n</code></td>
<td class="org-left"><b>Don&rsquo;t trim.</b> IF dealing with anything other than strings, this is the only option that won&rsquo;t raise an error.</td>
</tr>

<tr>
<td class="org-left"><code>l</code></td>
<td class="org-left"><b>Trim left.</b> Trim whitespace characters to the left of the string.</td>
</tr>

<tr>
<td class="org-left"><code>r</code></td>
<td class="org-left"><b>Trim right.</b> Trim whitespace characters to the right of the string.</td>
</tr>

<tr>
<td class="org-left"><code>b</code></td>
<td class="org-left"><b>Trim both sides.</b> Trim whitespace characters at both ends of the string.</td>
</tr>

<tr>
<td class="org-left">Anything Else</td>
<td class="org-left"><code>ValueError</code>: only <code>n</code>, <code>l</code>, <code>r</code> and <code>b</code> are allowed as values</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org11100cb" class="outline-3">
<h3 id="org11100cb"><span class="section-number-3">6.2.</span> Writing</h3>
<div class="outline-text-3" id="text-6-2">
<p>
Writing can only be done through keywords, albeit in 2 different ways:
</p>
<ul class="org-ul">
<li><b>Directly:</b> A direct modification involves the script creator themselves using a method that does not require any sort of confirmation from the user when it comes to modifying the cache.</li>
<li><b>Indirectly:</b> An indirect modification involves obtaining input from the user or the environment.</li>
</ul>
</div>
<div id="outline-container-org10b0fc3" class="outline-4">
<h4 id="org10b0fc3"><span class="section-number-4">6.2.1.</span> Keywords that Write to the Cache Directly</h4>
<div class="outline-text-4" id="text-6-2-1">
<ul class="org-ul">
<li><a href="#orgaeb1a20"><b><code>CLEAR</code></b></a> - clears the cache</li>
<li><a href="#org2d0143f"><b><code>SET</code></b></a> - writes to the cache</li>
<li><a href="#org7a32fd1"><b>All Mathematical Operations</b> (new in version 2)</a> - all of them write the result to the cache</li>
</ul>
</div>
<ol class="org-ol">
<li><a id="orgaeb1a20"></a><code>CLEAR</code><br />
<div class="outline-text-5" id="text-6-2-1-1">
<p>
This command clears the cache (fills it with empty bytes).
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Clears the cache.</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
<td class="org-left"><code>SyntaxError</code> - <code>CLEAR</code> takes 0 arguments, but more than 0 were given</td>
<td class="org-left"><code>CLEAR;</code></td>
</tr>
</tbody>
</table>
</div>
</li>
