documentation/cxsetup/cxsetup_2.0.org
**** =SET=
This command writes a value to the cache.

| Summary                      | Arguments                                                        | Returns | Exceptions | Example      |
|------------------------------+------------------------------------------------------------------+---------+------------+--------------|
| Writes a value to the cache. | ~Value~ - the value to write to the cache, can be of any data type | None    | None       | =SET ?? 44.5;= |

*** List of Keywords that Write to the Cache Indirectly
- [[=CIN= (2 arguments overload)][*=CIN= (any of the overloads)*]] - writes user input to cache
- [[=GETPASS=][*=GETPASS=*]] - writes user input to cache
- [[=SAFECIN= (2 arguments overload)][*=SAFECIN= (any of the overloads)*]] - writes user input to cache

** Benefits of caching
Cache is an extremely powerful tool, as it allows for many things. 2 examples are shown below:
- *Constants.* The equivalent to constants would be this (at the start of the script): =SET ?? 7;= and accessing it like this: =c0:1l:1:1:n=.
- *User Feedback.* Hey, the user knows best, right? You can obtain file paths, make decisions and much more, based on the user input.

* Environment Variables
Environment variables are yet another useful tool at your disposal as a creator of a CXSetup script. These are strings, but their syntax is different.

Example:
#+begin_src bash
>>> COUT ?? v'HOME'; // For this example, we're on Linux
/home/username
>>> COUT ?? v'VAR_THAT_DOESNT_EXIST';
VAR_THAT_DOESNT_EXIST
#+end_src

Syntax:
#+begin_src bash
v'VARNAME'
#+end_src

This is a great way to find values such as home directories, that are OS and usually machine-dependent.

* CX Vars (v2.0.0+)
Other than environment variables, there are also *CX Setup Variables*, new to v2.0.0.

While the feature is still pretty limited, the next versions will have more variables.

Variables can be used as arguments. In such case, they're written WITHOUT double quotes, just like regular text. They will be recognized as variables in case they are valid ones.

| Variable        | Data Type       | Value                       | Example                                                      |
|-----------------+-----------------+-----------------------------+--------------------------------------------------------------|
| =polarity=        | Boolean/integer | The polarity of the script. | =PROD ?? 7 ?? polarity; // 0 if negative=                      |
| =cxSetup.Version= | String          | The version of CX Setup.    | =COUT ?? "You're running: CXSetup "; COUT ?? cxSetup.Version;= |

* Polarity
Alongside cache, there's yet one more extremely useful feature that needs to be discussed: *polarity*. Its official name is *Specialized Boolean Cache* and it allows for *code paths*, kind of the same way *if/else* allows for different operations based on a comparison, in other languages.

There are exactly 2 commands that can modify the *polarity* of the script, but before we discuss them, we should discuss how to add polarity to our scripts.

