documentation/cxsetup/cxsetup_2.0.html
<li><a id="org2d0143f"></a><code>SET</code><br />
<div class="outline-text-5" id="text-6-2-1-2">
<p>
This command writes a value to the cache.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Writes a value to the cache.</td>
<td class="org-left"><code>Value</code> - the value to write to the cache, can be of any data type</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
<td class="org-left"><code>SET ?? 44.5;</code></td>
</tr>
</tbody>
</table>
</div>
</li>
</ol>
</div>
<div id="outline-container-org5e607ee" class="outline-4">
<h4 id="org5e607ee"><span class="section-number-4">6.2.2.</span> List of Keywords that Write to the Cache Indirectly</h4>
<div class="outline-text-4" id="text-6-2-2">
<ul class="org-ul">
<li><a href="#orge130f5f"><b><code>CIN</code> (any of the overloads)</b></a> - writes user input to cache</li>
<li><a href="#org0659034"><b><code>GETPASS</code></b></a> - writes user input to cache</li>
<li><a href="#org2bf3de1"><b><code>SAFECIN</code> (any of the overloads)</b></a> - writes user input to cache</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org26b895e" class="outline-3">
<h3 id="org26b895e"><span class="section-number-3">6.3.</span> Benefits of caching</h3>
<div class="outline-text-3" id="text-6-3">
<p>
Cache is an extremely powerful tool, as it allows for many things. 2 examples are shown below:
</p>
<ul class="org-ul">
<li><b>Constants.</b> The equivalent to constants would be this (at the start of the script): <code>SET ?? 7;</code> and accessing it like this: <code>c0:1l:1:1:n</code>.</li>
<li><b>User Feedback.</b> Hey, the user knows best, right? You can obtain file paths, make decisions and much more, based on the user input.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5ebd060" class="outline-2">
<h2 id="org5ebd060"><span class="section-number-2">7.</span> Environment Variables</h2>
<div class="outline-text-2" id="text-7">
<p>
Environment variables are yet another useful tool at your disposal as a creator of a CXSetup script. These are strings, but their syntax is different.
</p>

<p>
Example:
</p>
<div class="org-src-container">
<pre class="src src-bash">&gt;&gt;&gt; COUT ?? v<span style="color: #7984D1;">'HOME'</span>; // For this example, we<span style="color: #7984D1;">'re on Linux</span>
<span style="color: #7984D1;">/home/username</span>
<span style="color: #7984D1;">&gt;&gt;&gt; COUT ?? v'</span>VAR_THAT_DOESNT_EXIST<span style="color: #7984D1;">';</span>
<span style="color: #7984D1;">VAR_THAT_DOESNT_EXIST</span>
</pre>
</div>

<p>
Syntax:
</p>
<div class="org-src-container">
<pre class="src src-bash">v<span style="color: #7984D1;">'VARNAME'</span>
</pre>
</div>

<p>
This is a great way to find values such as home directories, that are OS and usually machine-dependent.
</p>
</div>
</div>
<div id="outline-container-org9203040" class="outline-2">
<h2 id="org9203040"><span class="section-number-2">8.</span> CX Vars (v2.0.0+)</h2>
<div class="outline-text-2" id="text-8">
<p>
Other than environment variables, there are also <b>CX Setup Variables</b>, new to v2.0.0.
</p>

<p>
While the feature is still pretty limited, the next versions will have more variables.
</p>

<p>
Variables can be used as arguments. In such case, they&rsquo;re written WITHOUT double quotes, just like regular text. They will be recognized as variables in case they are valid ones.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Variable</th>
<th scope="col" class="org-left">Data Type</th>
<th scope="col" class="org-left">Value</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>polarity</code></td>
<td class="org-left">Boolean/integer</td>
<td class="org-left">The polarity of the script.</td>
<td class="org-left"><code>PROD ?? 7 ?? polarity; // 0 if negative</code></td>
</tr>

<tr>
<td class="org-left"><code>cxSetup.Version</code></td>
<td class="org-left">String</td>
<td class="org-left">The version of CX Setup.</td>
<td class="org-left"><code>COUT ?? "You're running: CXSetup "; COUT ?? cxSetup.Version;</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org2134bd2" class="outline-2">
<h2 id="org2134bd2"><span class="section-number-2">9.</span> Polarity</h2>
<div class="outline-text-2" id="text-9">
<p>
Alongside cache, there&rsquo;s yet one more extremely useful feature that needs to be discussed: <b>polarity</b>. Its official name is <b>Specialized Boolean Cache</b> and it allows for <b>code paths</b>, kind of the same way <b>if/else</b> allows for different operations based on a comparison, in other languages.
</p>

<p>
There are exactly 2 commands that can modify the <b>polarity</b> of the script, but before we discuss them, we should discuss how to add polarity to our scripts.
</p>
</div>
