documentation/cxsetup/cxsetup_2.0.org
** Defining code paths
Let's say, for example, there's a dependency our setup script needs, but in a version of the OS, it's named ~x-dev~ and in another version of the very same OS, it's named ~x-pkg~. Clearly, this is going to raise issues. Thankfully, we can instruct the user on how to check what the name is and then ask them if it's one or the other. The only problem is that we cannot achieve comparisons.

Sure, we could do something like this, since both package names have exactly 5 characters:
#+begin_src bash
COUT ?? "Here's how to check whether the name is x-dev or x-pkg: etc etc etc...";
ENDL;
SAFECIN ?? 5 ?? "The name: ";
PKGRUN ?? "install" ?? c0:5l:1:3:b;
TERMINATE;
#+end_src

However, there are several issues with this script.
1. The user can input *ANY* name, which is problematic: they could be installing something they don't know is safe.
2. The user isn't restricted to 5 characters, they can insert a string with 1, 2, 3, etc.

So, how can we fix this code? Using *polarity*. Polarity has quite an unusual syntax.

In a script, *polarity* always starts off positive. Here's an example of a positive keyword:
#+begin_src C
+ENDL; // positive keyword - can only be done like this in v2.0.0 and above
#+end_src

You can, however, omit the ~+~ sign and it will still be interpreted as a positive keyword:
#+begin_src C
ENDL; // still a positive keyword - the only correct way to use one in v1.0.0
#+end_src

A negative keyword would look like this:
#+begin_src C
!ENDL; // negative keyword
#+end_src

There is also another *behavior declaration* available - the *indifferent* declaration, *introduced in v2.0.0*:
#+begin_src C
&ENDL; // indifferent keyword - new in v2.0.0
#+end_src

Indifferent keywords will run no matter what: they're indifferent to the *polarity*.

Getting back to our script, here's a refined version:
#+begin_src C
// the polarity starts off positive so we don't have to worry about COUT not running
COUT ?? "Here's how to check whether the name is x-dev or x-pkg: etc etc etc...";
ENDL; // command is positive so it runs, because the polarity is also positive
COUT ?? "Is the correct name 'x-dev'?"; ENDL;
YAYORNAY;
// polarity has now changed: YAYORNAY modified it
PKGRUN ?? "install" ?? "x-dev";
// the command above is positive so it will only run if the polairty is positive (if the user pressed 'y')
!PKGRUN ?? "install" ?? "x-pkg";
// the command above is negative so it will only run if the polarity is negative (if the user pressed 'n')

// we can clear the polarity by doing an indifferent reset
&RESET;

// That way, we don't have to do TERMINATE; !TERMINATE;, because we already know the polarity is going to be positive
TERMINATE;

// or, better: we could have just done &TERMINATE;
// Done!
#+end_src

Quite a complex example, I admit. Any command can be negated.

** =RESET=
This keyword simply resets the cache back to positive.

That is why it should only be used with a =!= or a =&= declarations, as it does not make sense to RESET an already positive polarity.

| Summary                                        | Arguments | Returns | Exceptions                                                        | Example |
|------------------------------------------------+-----------+---------+-------------------------------------------------------------------+---------|
| Resets the script's polarity back to *POSITIVE*. | None      | None    | ~SyntaxError~ - =RESET= takes 0 arguments, but more than 0 were given | =RESET;=  |

** =INVERT=
This keyword inverts the polarity.

| Summary                        | Arguments | Returns | Exceptions                                                         | Example |
|--------------------------------+-----------+---------+--------------------------------------------------------------------+---------|
| Inverts the script's polarity. | None      | None    | ~SyntaxError~ - =INVERT= takes 0 arguments, but more than 0 were given | =INVERT;= |

** =YAYORNAY=
Gets input from the user and adjusts the polarity accordingly (~y~ = POSITIVE, ~n~ = NEGATIVE)

| Summary                                                                           | Arguments | Returns | Exceptions                                                           | Example   |
|-----------------------------------------------------------------------------------+-----------+---------+----------------------------------------------------------------------+-----------|
| Changes the polarity to positive if the user input is *y* or to negative if it's *n*. | None      | None    | ~SyntaxError~ - =YAYORNAY= takes 0 arguments, but more than 0 were given | =YAYORNAY;= |

** Other polarity-related keywords
There are other keywords that can affect the polarity of the script, however. They are:

- [[File Operations (v2.0.0+)][*=PATH.EXISTS=*]] - Verifies if a given path exists
- [[File Operations (v2.0.0+)][*=DIR.EXISTS=*]] - Verifies if a given directory exists
- [[File Operations (v2.0.0+)][*=FILE.EXISTS=*]] - Verifies if a given file exists

