documentation/cxsetup/cxsetup_2.0.html
<div id="outline-container-org2e99972" class="outline-3">
<h3 id="org2e99972"><span class="section-number-3">9.1.</span> Defining code paths</h3>
<div class="outline-text-3" id="text-9-1">
<p>
Let&rsquo;s say, for example, there&rsquo;s a dependency our setup script needs, but in a version of the OS, it&rsquo;s named <code>x-dev</code> and in another version of the very same OS, it&rsquo;s named <code>x-pkg</code>. Clearly, this is going to raise issues. Thankfully, we can instruct the user on how to check what the name is and then ask them if it&rsquo;s one or the other. The only problem is that we cannot achieve comparisons.
</p>

<p>
Sure, we could do something like this, since both package names have exactly 5 characters:
</p>
<div class="org-src-container">
<pre class="src src-bash">COUT ?? <span style="color: #7984D1;">"Here's how to check whether the name is x-dev or x-pkg: etc etc etc..."</span>;
ENDL;
SAFECIN ?? <span style="color: #ffd400; font-weight: bold;">5</span> ?? <span style="color: #7984D1;">"The name: "</span>;
PKGRUN ?? <span style="color: #7984D1;">"install"</span> ?? c0:5l:1:3:b;
TERMINATE;
</pre>
</div>

<p>
However, there are several issues with this script.
</p>
<ol class="org-ol">
<li>The user can input <b>ANY</b> name, which is problematic: they could be installing something they don&rsquo;t know is safe.</li>
<li>The user isn&rsquo;t restricted to 5 characters, they can insert a string with 1, 2, 3, etc.</li>
</ol>

<p>
So, how can we fix this code? Using <b>polarity</b>. Polarity has quite an unusual syntax.
</p>

<p>
In a script, <b>polarity</b> always starts off positive. Here&rsquo;s an example of a positive keyword:
</p>
<div class="org-src-container">
<pre class="src src-C">+<span style="color: #df85ff; font-weight: bold;">ENDL</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">positive keyword - can only be done like this in v2.0.0 and above</span>
</pre>
</div>

<p>
You can, however, omit the <code>+</code> sign and it will still be interpreted as a positive keyword:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #df85ff; font-weight: bold;">ENDL</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">still a positive keyword - the only correct way to use one in v1.0.0</span>
</pre>
</div>

<p>
A negative keyword would look like this:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ff2afc; font-weight: bold;">!</span><span style="color: #df85ff; font-weight: bold;">ENDL</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">negative keyword</span>
</pre>
</div>

<p>
There is also another <b>behavior declaration</b> available - the <b>indifferent</b> declaration, <b>introduced in v2.0.0</b>:
</p>
<div class="org-src-container">
<pre class="src src-C">&amp;<span style="color: #df85ff; font-weight: bold;">ENDL</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">indifferent keyword - new in v2.0.0</span>
</pre>
</div>

<p>
Indifferent keywords will run no matter what: they&rsquo;re indifferent to the <b>polarity</b>.
</p>

<p>
Getting back to our script, here&rsquo;s a refined version:
</p>
<div class="org-src-container">
<pre class="src src-C"><span style="color: #546A90;">// </span><span style="color: #546A90;">the polarity starts off positive so we don't have to worry about COUT not running</span>
<span style="color: #df85ff; font-weight: bold;">COUT</span> ?? <span style="color: #7984D1;">"Here's how to check whether the name is x-dev or x-pkg: etc etc etc..."</span>;
<span style="color: #df85ff; font-weight: bold;">ENDL</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">command is positive so it runs, because the polarity is also positive</span>
<span style="color: #df85ff; font-weight: bold;">COUT</span> ?? <span style="color: #7984D1;">"Is the correct name 'x-dev'?"</span>; <span style="color: #df85ff; font-weight: bold;">ENDL</span>;
<span style="color: #df85ff; font-weight: bold;">YAYORNAY</span>;
<span style="color: #546A90;">// </span><span style="color: #546A90;">polarity has now changed: YAYORNAY modified it</span>
<span style="color: #df85ff; font-weight: bold;">PKGRUN</span> ?? <span style="color: #7984D1;">"install"</span> ?? <span style="color: #7984D1;">"x-dev"</span>;
<span style="color: #546A90;">// </span><span style="color: #546A90;">the command above is positive so it will only run if the polairty is positive (if the user pressed 'y')</span>
<span style="color: #ff2afc; font-weight: bold;">!</span><span style="color: #df85ff; font-weight: bold;">PKGRUN</span> ?? <span style="color: #7984D1;">"install"</span> ?? <span style="color: #7984D1;">"x-pkg"</span>;
<span style="color: #546A90;">// </span><span style="color: #546A90;">the command above is negative so it will only run if the polarity is negative (if the user pressed 'n')</span>

<span style="color: #546A90;">// </span><span style="color: #546A90;">we can clear the polarity by doing an indifferent reset</span>
&amp;<span style="color: #df85ff; font-weight: bold;">RESET</span>;

<span style="color: #546A90;">// </span><span style="color: #546A90;">That way, we don't have to do TERMINATE; !TERMINATE;, because we already know the polarity is going to be positive</span>
<span style="color: #df85ff; font-weight: bold;">TERMINATE</span>;

<span style="color: #546A90;">// </span><span style="color: #546A90;">or, better: we could have just done &amp;TERMINATE;</span>
<span style="color: #546A90;">// </span><span style="color: #546A90;">Done!</span>
</pre>
</div>

<p>
Quite a complex example, I admit. Any command can be negated.
</p>
</div>
</div>
<div id="outline-container-org7a96580" class="outline-3">
<h3 id="org7a96580"><span class="section-number-3">9.2.</span> <code>RESET</code></h3>
<div class="outline-text-3" id="text-9-2">
<p>
This keyword simply resets the cache back to positive.
</p>

<p>
That is why it should only be used with a <code>!</code> or a <code>&amp;</code> declarations, as it does not make sense to RESET an already positive polarity.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Resets the script&rsquo;s polarity back to <b>POSITIVE</b>.</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
<td class="org-left"><code>SyntaxError</code> - <code>RESET</code> takes 0 arguments, but more than 0 were given</td>
<td class="org-left"><code>RESET;</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga32937e" class="outline-3">
<h3 id="orga32937e"><span class="section-number-3">9.3.</span> <code>INVERT</code></h3>
<div class="outline-text-3" id="text-9-3">
<p>
This keyword inverts the polarity.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Inverts the script&rsquo;s polarity.</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
<td class="org-left"><code>SyntaxError</code> - <code>INVERT</code> takes 0 arguments, but more than 0 were given</td>
<td class="org-left"><code>INVERT;</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org8d8b53d" class="outline-3">
<h3 id="org8d8b53d"><span class="section-number-3">9.4.</span> <code>YAYORNAY</code></h3>
<div class="outline-text-3" id="text-9-4">
<p>
Gets input from the user and adjusts the polarity accordingly (<code>y</code> = POSITIVE, <code>n</code> = NEGATIVE)
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Summary</th>
<th scope="col" class="org-left">Arguments</th>
<th scope="col" class="org-left">Returns</th>
<th scope="col" class="org-left">Exceptions</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Changes the polarity to positive if the user input is <b>y</b> or to negative if it&rsquo;s <b>n</b>.</td>
<td class="org-left">None</td>
<td class="org-left">None</td>
<td class="org-left"><code>SyntaxError</code> - <code>YAYORNAY</code> takes 0 arguments, but more than 0 were given</td>
<td class="org-left"><code>YAYORNAY;</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgdff97b5" class="outline-3">
<h3 id="orgdff97b5"><span class="section-number-3">9.5.</span> Other polarity-related keywords</h3>
<div class="outline-text-3" id="text-9-5">
<p>
There are other keywords that can affect the polarity of the script, however. They are:
</p>

<ul class="org-ul">
<li><a href="#orga353f59"><b><code>PATH.EXISTS</code></b></a> - Verifies if a given path exists</li>
<li><a href="#orga353f59"><b><code>DIR.EXISTS</code></b></a> - Verifies if a given directory exists</li>
<li><a href="#orga353f59"><b><code>FILE.EXISTS</code></b></a> - Verifies if a given file exists</li>
</ul>
</div>
</div>
</div>
