documentation/cxsetup/cxsetup_2.0.org
* Mathematical Operations (v2.0.0+)
Mathematical operations, a new v2.0.0 feature, can prove themselves useful from time to time.

They are done through keywords:
| Keyword | Amount of arguments | Underlying Operation (Return Result)                                                         | Example                                                   |
|---------+---------------------+----------------------------------------------------------------------------------------------+-----------------------------------------------------------|
| =SUM=     |                 Any | Sum of all numeric values.                                                                   | =SUM ?? 4 ?? 7; // this will write 11 to the cache=         |
| =SUB=     |                   2 | Subtracts the second argument from the first.                                                | =SUB ?? 4 ?? 7; // this will write -3 to the cache=         |
| =DIV=     |                   2 | Divides the first number for the second. Truncates if they're both integers.                 | =DIV ?? 10 ?? 5; // this will write 2 to the cache=         |
| =PROD=    |                   2 | Multiplies the first argument with the second one.                                           | =PROD ?? 2 ?? 7; // this will write 14 to the cache=        |
| =REM=     |                   2 | Calculates the remainder of a division between the first argument and the second one.        | =REM ?? 10 ?? 7; // this will write 3 to the cache=         |
| =ABS=     |                   1 | Calculates the absolute value of a number.                                                   | =ABS ?? -5; // this will write 5 to the cache=              |
| =ROUND=   |                   2 | Rounds a float (first argument) to N decimal digits, where N is an integer (second argument). | =ROUND ?? 5.764 ?? 2; // this will write 5.76 to the cache= |

* File Operations (v2.0.0+)
*What's a setup script without file-related operations?* Well, these are new in v2.0.0 and are already powerful enough for most use cases.

They can be split into 2 groups:
- *The ones who modify the polarity.* These evaluate a boolean value (such as: "does this file exist?") and modify the polarity accordingly.
- *The ones who modify the cache.* These return a value that is written to the cache.
- *The ones who don't return anything.* These operate on the environment without modifying the cache or the polarity.

They are done through keywords:
| Keyword     | Modifies what? | Underlying Operation (Return Result)                                   | Example                                 |
|-------------+----------------+------------------------------------------------------------------------+-----------------------------------------|
| =PATH.EXISTS= | Polarity       | Verifies if a given path (string) exists.                              | =PATH.EXISTS ?? "/path/to/file";=         |
| =DIR.EXISTS=  | Polarity       | Verifies if a given path (string) exists and is a directory.           | =DIR.EXISTS ?? "/path/to/dir";=           |
| =FILE.EXISTS= | Polarity       | Verifies if a given path (string) exists and is a regular file.        | =FILE.EXISTS ?? "/path/to/file";=         |
| =ECHO=        | N/A            | Writes data (string) to a file path (string) without overwriting files. | =ECHO ?? "hello" ?? "/path/to/file";=     |
| =ECHORDIE=    | N/A            | Same as =ECHO= but overwrites files if necessary.                        | =ECHORDIE ?? "hello" ?? "/path/to/file";= |

* Cache Size Declaration
By default, the cache takes up 256 bytes, which may be too much for some scenarios.

Thankfully, you can define exactly how many bytes you want using *cache size declarations*.

These are performed at the very start of the file (first line). If the first line is equals to an integer, that integer will be interpreted as the cache size.

You may omit it, if you're fine with the default, but it's good practice to always define it.

#+begin_src C
70
// that was the cache size declaration
// make sure there is nothing else but the integer in the first line, as that is very important
// negative cache sizes or ones that equal 0 are invalid (minimum is 1 byte)

// Your code goes here...
COUT ?? "Hello, World!";
// ...
#+end_src

* Examples
Below, you can find example scripts.

** Writing Hello, World! to a file called cxsetup-playground
#+begin_src C
200

// Constants
SET ?? v'HOME';
SET ?? "/cxsetup-playground";

COUT ?? "Does a file named cxsetup-playground exist in your home directory?";
ENDL;
YAYORNAY;

// If it doesn't exist, we'll get rid of it.
RUN ?? "rm" ?? c0:199l:1:3:b; // trim both sides -> very important

// Invert the polarity to negative if positive
INVERT;

// now, the polarity is 100% sure negative
// Let's save the file
// Of coruse we could have just used ECHORDIE, but this is supposed to showoff the power of this language sooo
!ECHO ?? "Hello, World!" ?? c0:199l:1:3:b;
!COUT ?? "Finished."; !ENDL;
!TERMINATE; // done
#+end_src

