documentation/cxsetup/cxsetup_2.0.html
<div id="outline-container-org7a32fd1" class="outline-2">
<h2 id="org7a32fd1"><span class="section-number-2">10.</span> Mathematical Operations (v2.0.0+)</h2>
<div class="outline-text-2" id="text-10">
<p>
Mathematical operations, a new v2.0.0 feature, can prove themselves useful from time to time.
</p>

<p>
They are done through keywords:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keyword</th>
<th scope="col" class="org-right">Amount of arguments</th>
<th scope="col" class="org-left">Underlying Operation (Return Result)</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>SUM</code></td>
<td class="org-right">Any</td>
<td class="org-left">Sum of all numeric values.</td>
<td class="org-left"><code>SUM ?? 4 ?? 7; // this will write 11 to the cache</code></td>
</tr>

<tr>
<td class="org-left"><code>SUB</code></td>
<td class="org-right">2</td>
<td class="org-left">Subtracts the second argument from the first.</td>
<td class="org-left"><code>SUB ?? 4 ?? 7; // this will write -3 to the cache</code></td>
</tr>

<tr>
<td class="org-left"><code>DIV</code></td>
<td class="org-right">2</td>
<td class="org-left">Divides the first number for the second. Truncates if they&rsquo;re both integers.</td>
<td class="org-left"><code>DIV ?? 10 ?? 5; // this will write 2 to the cache</code></td>
</tr>

<tr>
<td class="org-left"><code>PROD</code></td>
<td class="org-right">2</td>
<td class="org-left">Multiplies the first argument with the second one.</td>
<td class="org-left"><code>PROD ?? 2 ?? 7; // this will write 14 to the cache</code></td>
</tr>

<tr>
<td class="org-left"><code>REM</code></td>
<td class="org-right">2</td>
<td class="org-left">Calculates the remainder of a division between the first argument and the second one.</td>
<td class="org-left"><code>REM ?? 10 ?? 7; // this will write 3 to the cache</code></td>
</tr>

<tr>
<td class="org-left"><code>ABS</code></td>
<td class="org-right">1</td>
<td class="org-left">Calculates the absolute value of a number.</td>
<td class="org-left"><code>ABS ?? -5; // this will write 5 to the cache</code></td>
</tr>

<tr>
<td class="org-left"><code>ROUND</code></td>
<td class="org-right">2</td>
<td class="org-left">Rounds a float (first argument) to N decimal digits, where N is an integer (second argument).</td>
<td class="org-left"><code>ROUND ?? 5.764 ?? 2; // this will write 5.76 to the cache</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orga353f59" class="outline-2">
<h2 id="orga353f59"><span class="section-number-2">11.</span> File Operations (v2.0.0+)</h2>
<div class="outline-text-2" id="text-11">
<p>
<b>What&rsquo;s a setup script without file-related operations?</b> Well, these are new in v2.0.0 and are already powerful enough for most use cases.
</p>

<p>
They can be split into 2 groups:
</p>
<ul class="org-ul">
<li><b>The ones who modify the polarity.</b> These evaluate a boolean value (such as: &ldquo;does this file exist?&rdquo;) and modify the polarity accordingly.</li>
<li><b>The ones who modify the cache.</b> These return a value that is written to the cache.</li>
<li><b>The ones who don&rsquo;t return anything.</b> These operate on the environment without modifying the cache or the polarity.</li>
</ul>

<p>
They are done through keywords:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Keyword</th>
<th scope="col" class="org-left">Modifies what?</th>
<th scope="col" class="org-left">Underlying Operation (Return Result)</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><code>PATH.EXISTS</code></td>
<td class="org-left">Polarity</td>
<td class="org-left">Verifies if a given path (string) exists.</td>
<td class="org-left"><code>PATH.EXISTS ?? "/path/to/file";</code></td>
</tr>

<tr>
<td class="org-left"><code>DIR.EXISTS</code></td>
<td class="org-left">Polarity</td>
<td class="org-left">Verifies if a given path (string) exists and is a directory.</td>
<td class="org-left"><code>DIR.EXISTS ?? "/path/to/dir";</code></td>
</tr>

<tr>
<td class="org-left"><code>FILE.EXISTS</code></td>
<td class="org-left">Polarity</td>
<td class="org-left">Verifies if a given path (string) exists and is a regular file.</td>
<td class="org-left"><code>FILE.EXISTS ?? "/path/to/file";</code></td>
</tr>

<tr>
<td class="org-left"><code>ECHO</code></td>
<td class="org-left">N/A</td>
<td class="org-left">Writes data (string) to a file path (string) without overwriting files.</td>
<td class="org-left"><code>ECHO ?? "hello" ?? "/path/to/file";</code></td>
</tr>

<tr>
<td class="org-left"><code>ECHORDIE</code></td>
<td class="org-left">N/A</td>
<td class="org-left">Same as <code>ECHO</code> but overwrites files if necessary.</td>
<td class="org-left"><code>ECHORDIE ?? "hello" ?? "/path/to/file";</code></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org17ec4fa" class="outline-2">
<h2 id="org17ec4fa"><span class="section-number-2">12.</span> Cache Size Declaration</h2>
<div class="outline-text-2" id="text-12">
<p>
By default, the cache takes up 256 bytes, which may be too much for some scenarios.
</p>

<p>
Thankfully, you can define exactly how many bytes you want using <b>cache size declarations</b>.
</p>

<p>
These are performed at the very start of the file (first line). If the first line is equals to an integer, that integer will be interpreted as the cache size.
</p>

<p>
You may omit it, if you&rsquo;re fine with the default, but it&rsquo;s good practice to always define it.
</p>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffd400; font-weight: bold;">70</span>
<span style="color: #546A90;">// </span><span style="color: #546A90;">that was the cache size declaration</span>
<span style="color: #546A90;">// </span><span style="color: #546A90;">make sure there is nothing else but the integer in the first line, as that is very important</span>
<span style="color: #546A90;">// </span><span style="color: #546A90;">negative cache sizes or ones that equal 0 are invalid (minimum is 1 byte)</span>

<span style="color: #546A90;">// </span><span style="color: #546A90;">Your code goes here...</span>
<span style="color: #df85ff; font-weight: bold;">COUT</span> ?? <span style="color: #7984D1;">"Hello, World!"</span>;
<span style="color: #546A90;">// </span><span style="color: #546A90;">...</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org40bcf0a" class="outline-2">
<h2 id="org40bcf0a"><span class="section-number-2">13.</span> Examples</h2>
<div class="outline-text-2" id="text-13">
<p>
Below, you can find example scripts.
</p>
</div>
<div id="outline-container-orge8976cc" class="outline-3">
<h3 id="orge8976cc"><span class="section-number-3">13.1.</span> Writing Hello, World! to a file called cxsetup-playground</h3>
<div class="outline-text-3" id="text-13-1">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffd400; font-weight: bold;">200</span>

<span style="color: #546A90;">// </span><span style="color: #546A90;">Constants</span>
<span style="color: #df85ff; font-weight: bold;">SET</span> ?? v<span style="color: #ffd400;">'</span><span style="color: #df85ff; font-weight: bold;">HOME</span><span style="color: #ffd400;">'</span>;
<span style="color: #df85ff; font-weight: bold;">SET</span> ?? <span style="color: #7984D1;">"/cxsetup-playground"</span>;

<span style="color: #df85ff; font-weight: bold;">COUT</span> ?? <span style="color: #7984D1;">"Does a file named cxsetup-playground exist in your home directory?"</span>;
<span style="color: #df85ff; font-weight: bold;">ENDL</span>;
<span style="color: #df85ff; font-weight: bold;">YAYORNAY</span>;

<span style="color: #546A90;">// </span><span style="color: #546A90;">If it doesn't exist, we'll get rid of it.</span>
<span style="color: #df85ff; font-weight: bold;">RUN</span> ?? <span style="color: #7984D1;">"rm"</span> ?? c0:<span style="color: #ffd400; font-weight: bold;">199l</span>:<span style="color: #ffd400; font-weight: bold;">1</span>:<span style="color: #ffd400; font-weight: bold;">3</span>:b; <span style="color: #546A90;">// </span><span style="color: #546A90;">trim both sides -&gt; very important</span>

<span style="color: #546A90;">// </span><span style="color: #546A90;">Invert the polarity to negative if positive</span>
<span style="color: #df85ff; font-weight: bold;">INVERT</span>;

<span style="color: #546A90;">// </span><span style="color: #546A90;">now, the polarity is 100% sure negative</span>
<span style="color: #546A90;">// </span><span style="color: #546A90;">Let's save the file</span>
<span style="color: #546A90;">// </span><span style="color: #546A90;">Of coruse we could have just used ECHORDIE, but this is supposed to showoff the power of this language sooo</span>
<span style="color: #ff2afc; font-weight: bold;">!</span><span style="color: #df85ff; font-weight: bold;">ECHO</span> ?? <span style="color: #7984D1;">"Hello, World!"</span> ?? c0:<span style="color: #ffd400; font-weight: bold;">199l</span>:<span style="color: #ffd400; font-weight: bold;">1</span>:<span style="color: #ffd400; font-weight: bold;">3</span>:b;
<span style="color: #ff2afc; font-weight: bold;">!</span><span style="color: #df85ff; font-weight: bold;">COUT</span> ?? <span style="color: #7984D1;">"Finished."</span>; <span style="color: #ff2afc; font-weight: bold;">!</span><span style="color: #df85ff; font-weight: bold;">ENDL</span>;
<span style="color: #ff2afc; font-weight: bold;">!</span><span style="color: #df85ff; font-weight: bold;">TERMINATE</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">done</span>
</pre>
</div>
</div>
</div>
