documentation/cxsetup/cxsetup_2.0.org
** Global Cheat Sheet (for v1.0.0)
#+begin_src C
50
// That is a cache size declaration

// This is a comment.

COUT ?? "String";
COUT ?? 4; // Integer
COUT ?? 5.7; // Float
COUT ?? v'HOME'; // If the variable exists, its value is used
COUT ?? v'TESTING'; // If it doesn't, its name is used instead
COUT ?? "a"; // Single character

CIN; // get input
CLEAR; // clear the cache
CIN ?? 5; // 5 character limit
CLEAR; CIN ?? 4; CLEAR; // you don't have to split instructions across lines if you don't want to
CIN ?? 4 ?? "Your input, if you may: "; // custom prompt message
CLEAR;

SAFECIN ?? 5; // better input management
CLEAR; SAFECIN ?? 4 ?? "Better input: "; // custom prompt message

ENDL2; // 2 new lines
COUT ?? c0:4l:1:3:b; // Cache Grab: starts at 0, length = 4, no pattern, as string, trim both sides
ENDL; // 1 new line

!TERMINATE; // this won't run since the polarity is positive

INVERT; // inverts the polarity
TERMINATE; // this won't run because, now, the polarity is negative
INVERT; // neither will this
!INVERT; // but this will

ECHO ?? "Back to normal." ?? ""; // the filepath is empty, so this will just COUT
ENDL;

ECHO ?? "Hello, World!" ?? "hello.txt"; // write to a file, as long as it does not exist
ECHORDIE ?? "Hello, World!" ?? "forced_hello.txt"; // write to a file, even if that means overwriting it

FORE ?? "BLUE";
BACK ?? "YELLOW";
STYLE ?? "DIM";
COUT ?? "Blue text on a yellow background, with a dim style";
STYLE ?? "RESET_ALL";
ENDL2;

GETPASS ?? "Enter the secret code: "; // Same as CIN ?? 0 ?? "Enter the secret code: " but hides the characters that are being typed

CLEAR;

RUN ?? "neofetch"; // runs a subprocess
RUN ?? "clear"; // this will clear the screen, for example

PKGRUN ?? "install" ?? "figlet"; // on Debian, this would be the same as RUN ?? "apt" ?? "install" ?? "figlet";
PIPRUN ?? "install" ?? "PyLocalizer"; // same as RUN ?? "pip" ?? "install" ?? "PyLocalizer", but uses the pip version recommended by the system
NPMRUN ?? "install" ?? "express"; // same as RUN ?? "npm" ?? "install" ?? "express", but makes sure the global npm installation is used

CLEAR;
SET ?? "sl"; // save PyLocalizer as a constant to the cache
REQUIRES ?? 0 ?? c0:2l:1:3:b; // mark sl as a requirement for the package manager
REQUIRES ?? 1 ?? "PyLocalizer"; // mark PyLocalizer as a requirement for PIP

REQINSTALL; // install all previously marked requirements

YAYORNAY; // if the user inputs y, the polarity becomes positive. Otherwise, it becomes negative

!COUT ?? "Polarity is negative. Exiting with error code 1";
!ENDL;
!TERMINATE ?? 1; // terminate with error code 1

TERMINATE; // terminate with success code 0, same as TERMINATE ?? 0;
COUT ?? "Hi"; // this won't run
#+end_src

* Other tools
CXSetup isn't limited to the interpreter.
- [[https://github.com/MF366-Coding/CXSetup/blob/main/cxhighlight.py][*CX Setup Syntax Highlighter*]] (can be used in the terminal or imported and used from a Python file)
- *CX Setup Linter* (coming soon)
- [[https://marketplace.visualstudio.com/items/?itemName=MF366.cxsetup][*CX Setup Language for VSCode*]] (syntax highlighting for Visual Studio Code)


#  LocalWords:  toc GFDL's COUT ENDL2 LIGHTBLACK LIGHTBLUE LIGHTGREEN LIGHTRED
#  LocalWords:  LIGHTYELLOW LIGHTMAGENTA LIGHTCYAN LIGHTWHITE CIN CharLimit OkA
#  LocalWords:  InternalError PromptMessage GETPASS SAFECIN FileExistsError npm
#  LocalWords:  DataToWrite FilePath ECHORDIE PIPRUN PKGRUN NPMRUN REQINSTALL
#  LocalWords:  DependencyName Hlo ol
