documentation/cxsetup/cxsetup_2.0.html
<div id="outline-container-orga022007" class="outline-3">
<h3 id="orga022007"><span class="section-number-3">13.2.</span> Global Cheat Sheet (for v1.0.0)</h3>
<div class="outline-text-3" id="text-13-2">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #ffd400; font-weight: bold;">50</span>
<span style="color: #546A90;">// </span><span style="color: #546A90;">That is a cache size declaration</span>

<span style="color: #546A90;">// </span><span style="color: #546A90;">This is a comment.</span>

<span style="color: #df85ff; font-weight: bold;">COUT</span> ?? <span style="color: #7984D1;">"String"</span>;
<span style="color: #df85ff; font-weight: bold;">COUT</span> ?? <span style="color: #ffd400; font-weight: bold;">4</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">Integer</span>
<span style="color: #df85ff; font-weight: bold;">COUT</span> ?? <span style="color: #ffd400; font-weight: bold;">5.7</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">Float</span>
<span style="color: #df85ff; font-weight: bold;">COUT</span> ?? v<span style="color: #ffd400;">'</span><span style="color: #df85ff; font-weight: bold;">HOME</span><span style="color: #ffd400;">'</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">If the variable exists, its value is used</span>
<span style="color: #df85ff; font-weight: bold;">COUT</span> ?? v<span style="color: #ffd400;">'</span><span style="color: #df85ff; font-weight: bold;">TESTING</span><span style="color: #ffd400;">'</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">If it doesn't, its name is used instead</span>
<span style="color: #df85ff; font-weight: bold;">COUT</span> ?? <span style="color: #7984D1;">"a"</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">Single character</span>

<span style="color: #df85ff; font-weight: bold;">CIN</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">get input</span>
<span style="color: #df85ff; font-weight: bold;">CLEAR</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">clear the cache</span>
<span style="color: #df85ff; font-weight: bold;">CIN</span> ?? <span style="color: #ffd400; font-weight: bold;">5</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">5 character limit</span>
<span style="color: #df85ff; font-weight: bold;">CLEAR</span>; <span style="color: #df85ff; font-weight: bold;">CIN</span> ?? <span style="color: #ffd400; font-weight: bold;">4</span>; <span style="color: #df85ff; font-weight: bold;">CLEAR</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">you don't have to split instructions across lines if you don't want to</span>
<span style="color: #df85ff; font-weight: bold;">CIN</span> ?? <span style="color: #ffd400; font-weight: bold;">4</span> ?? <span style="color: #7984D1;">"Your input, if you may: "</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">custom prompt message</span>
<span style="color: #df85ff; font-weight: bold;">CLEAR</span>;

<span style="color: #df85ff; font-weight: bold;">SAFECIN</span> ?? <span style="color: #ffd400; font-weight: bold;">5</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">better input management</span>
<span style="color: #df85ff; font-weight: bold;">CLEAR</span>; <span style="color: #df85ff; font-weight: bold;">SAFECIN</span> ?? <span style="color: #ffd400; font-weight: bold;">4</span> ?? <span style="color: #7984D1;">"Better input: "</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">custom prompt message</span>

ENDL2; <span style="color: #546A90;">// </span><span style="color: #546A90;">2 new lines</span>
<span style="color: #df85ff; font-weight: bold;">COUT</span> ?? c0:<span style="color: #ffd400; font-weight: bold;">4l</span>:<span style="color: #ffd400; font-weight: bold;">1</span>:<span style="color: #ffd400; font-weight: bold;">3</span>:b; <span style="color: #546A90;">// </span><span style="color: #546A90;">Cache Grab: starts at 0, length = 4, no pattern, as string, trim both sides</span>
<span style="color: #df85ff; font-weight: bold;">ENDL</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">1 new line</span>

<span style="color: #ff2afc; font-weight: bold;">!</span><span style="color: #df85ff; font-weight: bold;">TERMINATE</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">this won't run since the polarity is positive</span>

<span style="color: #df85ff; font-weight: bold;">INVERT</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">inverts the polarity</span>
<span style="color: #df85ff; font-weight: bold;">TERMINATE</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">this won't run because, now, the polarity is negative</span>
<span style="color: #df85ff; font-weight: bold;">INVERT</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">neither will this</span>
<span style="color: #ff2afc; font-weight: bold;">!</span><span style="color: #df85ff; font-weight: bold;">INVERT</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">but this will</span>

<span style="color: #df85ff; font-weight: bold;">ECHO</span> ?? <span style="color: #7984D1;">"Back to normal."</span> ?? <span style="color: #7984D1;">""</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">the filepath is empty, so this will just COUT</span>
<span style="color: #df85ff; font-weight: bold;">ENDL</span>;

<span style="color: #df85ff; font-weight: bold;">ECHO</span> ?? <span style="color: #7984D1;">"Hello, World!"</span> ?? <span style="color: #7984D1;">"hello.txt"</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">write to a file, as long as it does not exist</span>
<span style="color: #df85ff; font-weight: bold;">ECHORDIE</span> ?? <span style="color: #7984D1;">"Hello, World!"</span> ?? <span style="color: #7984D1;">"forced_hello.txt"</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">write to a file, even if that means overwriting it</span>

<span style="color: #df85ff; font-weight: bold;">FORE</span> ?? <span style="color: #7984D1;">"BLUE"</span>;
<span style="color: #df85ff; font-weight: bold;">BACK</span> ?? <span style="color: #7984D1;">"YELLOW"</span>;
<span style="color: #df85ff; font-weight: bold;">STYLE</span> ?? <span style="color: #7984D1;">"DIM"</span>;
<span style="color: #df85ff; font-weight: bold;">COUT</span> ?? <span style="color: #7984D1;">"Blue text on a yellow background, with a dim style"</span>;
<span style="color: #df85ff; font-weight: bold;">STYLE</span> ?? <span style="color: #7984D1;">"RESET_ALL"</span>;
ENDL2;

<span style="color: #df85ff; font-weight: bold;">GETPASS</span> ?? <span style="color: #7984D1;">"Enter the secret code: "</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">Same as CIN ?? 0 ?? "Enter the secret code: " but hides the characters that are being typed</span>

<span style="color: #df85ff; font-weight: bold;">CLEAR</span>;

<span style="color: #df85ff; font-weight: bold;">RUN</span> ?? <span style="color: #7984D1;">"neofetch"</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">runs a subprocess</span>
<span style="color: #df85ff; font-weight: bold;">RUN</span> ?? <span style="color: #7984D1;">"clear"</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">this will clear the screen, for example</span>

<span style="color: #df85ff; font-weight: bold;">PKGRUN</span> ?? <span style="color: #7984D1;">"install"</span> ?? <span style="color: #7984D1;">"figlet"</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">on Debian, this would be the same as RUN ?? "apt" ?? "install" ?? "figlet";</span>
<span style="color: #df85ff; font-weight: bold;">PIPRUN</span> ?? <span style="color: #7984D1;">"install"</span> ?? <span style="color: #7984D1;">"PyLocalizer"</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">same as RUN ?? "pip" ?? "install" ?? "PyLocalizer", but uses the pip version recommended by the system</span>
<span style="color: #df85ff; font-weight: bold;">NPMRUN</span> ?? <span style="color: #7984D1;">"install"</span> ?? <span style="color: #7984D1;">"express"</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">same as RUN ?? "npm" ?? "install" ?? "express", but makes sure the global npm installation is used</span>

<span style="color: #df85ff; font-weight: bold;">CLEAR</span>;
<span style="color: #df85ff; font-weight: bold;">SET</span> ?? <span style="color: #7984D1;">"sl"</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">save PyLocalizer as a constant to the cache</span>
<span style="color: #df85ff; font-weight: bold;">REQUIRES</span> ?? <span style="color: #ffd400; font-weight: bold;">0</span> ?? c0:<span style="color: #ffd400; font-weight: bold;">2l</span>:<span style="color: #ffd400; font-weight: bold;">1</span>:<span style="color: #ffd400; font-weight: bold;">3</span>:b; <span style="color: #546A90;">// </span><span style="color: #546A90;">mark sl as a requirement for the package manager</span>
<span style="color: #df85ff; font-weight: bold;">REQUIRES</span> ?? <span style="color: #ffd400; font-weight: bold;">1</span> ?? <span style="color: #7984D1;">"PyLocalizer"</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">mark PyLocalizer as a requirement for PIP</span>

<span style="color: #df85ff; font-weight: bold;">REQINSTALL</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">install all previously marked requirements</span>

<span style="color: #df85ff; font-weight: bold;">YAYORNAY</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">if the user inputs y, the polarity becomes positive. Otherwise, it becomes negative</span>

<span style="color: #ff2afc; font-weight: bold;">!</span><span style="color: #df85ff; font-weight: bold;">COUT</span> ?? <span style="color: #7984D1;">"Polarity is negative. Exiting with error code 1"</span>;
<span style="color: #ff2afc; font-weight: bold;">!</span><span style="color: #df85ff; font-weight: bold;">ENDL</span>;
<span style="color: #ff2afc; font-weight: bold;">!</span><span style="color: #df85ff; font-weight: bold;">TERMINATE</span> ?? <span style="color: #ffd400; font-weight: bold;">1</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">terminate with error code 1</span>

<span style="color: #df85ff; font-weight: bold;">TERMINATE</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">terminate with success code 0, same as TERMINATE ?? 0;</span>
<span style="color: #df85ff; font-weight: bold;">COUT</span> ?? <span style="color: #7984D1;">"Hi"</span>; <span style="color: #546A90;">// </span><span style="color: #546A90;">this won't run</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5129cef" class="outline-2">
<h2 id="org5129cef"><span class="section-number-2">14.</span> Other tools</h2>
<div class="outline-text-2" id="text-14">
<p>
CXSetup isn&rsquo;t limited to the interpreter.
</p>
<ul class="org-ul">
<li><a href="https://github.com/MF366-Coding/CXSetup/blob/main/cxhighlight.py"><b>CX Setup Syntax Highlighter</b></a> (can be used in the terminal or imported and used from a Python file)</li>
<li><b>CX Setup Linter</b> (coming soon)</li>
<li><a href="https://marketplace.visualstudio.com/items/?itemName=MF366.cxsetup"><b>CX Setup Language for VSCode</b></a> (syntax highlighting for Visual Studio Code)</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matthew (MF366)</p>
<p class="date">Created: 2025-04-18 sex 20:27</p>
</div>
</body>
</html>
